[{"track_id": 144542550, "title": "God's Plan", "artist": "Drake", "lyrics": "Yeah, they wishin' and wishin'. And wishin' and wishin'. They wishin' on me, yuh. . I been movin' calm, don't start no trouble with me. Tryna keep it peaceful is a struggle for me. Don't pull up at 6 AM to cuddle with me. You know how I like it when you lovin' on me. I don't wanna die for them to miss me. Yes, I see the things that they wishin' on me. Hope I got some brothers that outlive me. They gon' tell the story, shit was different with me. . God's plan, God's plan. I hold back, sometimes I won't, yuh. I feel good, sometimes I don't, ayy, don't. I finessed down Weston Road, ayy, 'nessed. Might go down a G.O.D., yeah, wait. I go hard on Southside G, yuh, wait. I make sure that north-side eat. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 133527628, "title": "Meant to Be", "artist": "Bebe Rexha feat. Florida Georgia Line", "lyrics": "Baby, lay on back and relax. Kick your pretty feet up on my dash. No need to go nowhere fast. Let's enjoy right here where we at. . Who knows where this road is supposed to lead. We got nothin' but time. As long as you're right here next to me. Everything's gonna be alright. . If it's meant to be, it'll be, it'll be. Baby, just let it be. If it's meant to be, it'll be, it'll be. Baby, just let it be. . So, won't you ride with me, ride with me?. See where this thing goes. If it's meant to be, it'll be, it'll be. Baby, if it's meant to be. . I don't need to be so uptight. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 124985078, "title": "Perfect", "artist": "Ed Sheeran", "lyrics": "I found a love for me. Oh darling, just dive right in and follow my lead. Well, I found a girl, beautiful and sweet. Oh, I never knew you were the someone waiting for me. 'Cause we were just kids when we fell in love. Not knowing what it was. I will not give you up this time. But darling, just kiss me slow, your heart is all I own. And in your eyes, you're holding mine. . Baby, I'm dancing in the dark with you between my arms. Barefoot on the grass, listening to our favourite song. When you said you looked a mess, I whispered underneath my breath. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144765189, "title": "The Middle", "artist": "Zedd feat. Maren Morris & Grey", "lyrics": "Take a seat. Right over there, sat on the stairs. Stay or leave. The cabinets are bare, and I'm unaware. Of just how we got into this mess. Got so aggressive. I know we meant all good intentions. . So pull me closer. Why don't you pull me close?. Why don't you come on over?. I can't just let you go. . Oh, baby. Why don't you just meet me in the middle?. I'm losing my mind just a little. So why don't you just meet me in the middle?. In the middle. . Baby. Why don't you just meet me in the middle?. I'm losing my mind just a little. So why don't you just meet me in the middle?. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 145577915, "title": "Look Alive", "artist": "BlocBoy JB feat. Drake", "lyrics": "Tay Keith, fuck these niggas on. Yeah yeah (woo!). Yeah (6 God, BlocBoy, 6 God, BlocBoy, woo!). (6 God, BlocBoy, 6 God, BlocBoy, woo!). Yeah. . 901 Shelby Drive, look alive, look alive. Niggas came up on this side, now they on the other side. Oh well, fuck 'em dog, we gon' see how hard they ride. I get racks to go outside, and I split it with the guys. We up on the other side, niggas actin' like we tied. I've been gone since like July, niggas actin' like I died. They won't be expectin' shit when Capo go to slide. 'Cause I told them that we put that shit behind us, but I lied. . Ayy, ayy, look who I'm around, man. If I fucked up, I'ma be downtown, man. Fourth floor bound, man, that's if I get caught, man. Pushed me to the edge, so it really ain't my mothafuckin' fault, man. I'm not to blame, man. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 143877923, "title": "Finesse (Remix)", "artist": "Bruno Mars feat. Cardi B", "lyrics": "Drop top Porsche (Porsche), Rollie on my wrist (wrist). Diamonds up and down my chain (aha). Cardi B, straight stuntin', can't tell me nothin'. Bossed up and I changed the game (you see me?). It's my big Bronx boogie, got all them girls shook (shook). My big fat ass got all them boys hooked (hooked). I went from dollar bills, now we poppin' rubber bands (ha). Bruno sang to me while I do my money dance like ayy. Flexin' on the 'Gram like ayy. Hit the Lil' Jon, okay (okay), okay (okay). Oh yeah, we drippin' in finesse and getting paid, ow. . Ooh, don't we look good together?. There's a reason why they watch all night long (all night long). Yeah, I know we'll turn heads forever (forever). So tonight, I'm gonna show you off. . When I'm walkin' with you. I watch the whole room change. Baby, that's what you do. No, my baby, don't play. Blame it on my confidence. Oh, blame it on your measurements. Shut that shit down on sight. That's right. . We out here drippin' in finesse. It don't make no sense. Out here drippin' in finesse. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 143930791, "title": "Say Something", "artist": "Justin Timberlake feat. Chris Stapleton", "lyrics": "Yeah, alright. . Everyone knows all about my direction. And in my heart somewhere. I wanna go there. Still I don't go there. . Everybody says \"say something that says something\". \"Say something that says something\". \"Say something that says something\". I don't wanna get caught up in the rhythm of it. But I can't help myself. No, I can't help myself. No, no. I'm caught up in the middle of it. No, I can't help myself. No, I can't help myself. No, no, no. Caught up in the rhythm of it. . Maybe I'm looking for something I can't have. (Maybe I'm looking for something I can't have). Maybe I'm looking for something I can't have. . Everyone knows all about my transgressions. Still in my heart somewhere. There's melody and harmony. For you and me tonight. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 142504979, "title": "Havana", "artist": "Camila Cabello feat. Young Thug", "lyrics": "Hey. . Havana, ooh na-na (ayy). Half of my heart is in Havana, ooh na-na (ayy, ayy). He took me back to East Atlanta, na-na-na, ah. All of my heart is in Havana (ayy). There's somethin' 'bout his manners (uh huh). Havana, ooh na-na (uh). . He didn't walk up with that \"how you doin'?\" (uh). When he came in the room. He said there's a lot of girls I can do with (uh). But I can't without you. I knew him forever in a minute (hey). That summer night in June. And papa says he got malo in him (uh). He got me feelin' like.... . Ooh-ooh-ooh-ooh-ooh-ooh-ooh-ooh (ayy). I knew it when I met him (ayy), I loved him when I left him. Got me feelin' like, ooh-ooh-ooh-ooh-ooh-ooh-ooh-ooh. And then I had to tell him, I had to go. Oh na-na-na-na-na (woo). . Havana, ooh na-na (ayy, ayy). Half of my heart is in Havana, ooh na-na (ayy, ayy). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144205601, "title": "The Champion", "artist": "Carrie Underwood feat. Ludacris", "lyrics": "I'll be the last one standing. Two hands in the air, I'm a champion. You'll be looking up at me when it's over. I live for the battle, I'm a soldier, yeah. I'm a fighter like Rocky. Put your flag on your back like Ali. Yeah, I'm the greatest I'm stronger. Paid my dues, can't lose, I'm own ya, ay. . I've been working my whole life. And now it's do or die. . I am invincible, unbreakable. Unstoppable, unshakeable. They knock me down, I get up again. I am the champion, you're gon' know my name. You can't hurt me now, I can't feel the pain. I was made for this, yeah, I was born to win. I am the champion. . When they write my story. They gonna say that I did it for the glory. But don't think that I did it for the fame, yeah. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144866921, "title": "You Make It Easy", "artist": "Jason Aldean", "lyrics": "Like a rainy Sunday morning makes me want to stay in bed. Twisted up all day long. You're my inspiration, girl you take me places. Put the words right into these songs. . Stealing kisses under cover, babe. See forever when I see your face. And I swear God made you for me. . You make it easy. Lovin' up on you. Make it easy. With every little thing you do. You're my sunshine in the darkest days. My better half, my saving grace. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 129576338, "title": "Thunder", "artist": "Imagine Dragons", "lyrics": "Just a young gun with a quick fuse. I was uptight, wanna let loose. I was dreaming of bigger things. And wanna leave my own life behind. Not a yes sir, not a follower. Fit the box, fit the mold. Have a seat in the foyer, take a number. I was lightning before the thunder. . Thunder, thunder. Thunder, thun-, thunder. Thun-thun-thunder, thunder, thunder. Thunder, thun-, thunder. Thun-thun-thunder, thunder. . Thunder, feel the thunder. Lightning and the thunder. Thunder, feel the thunder. Lightning and the thunder. Thunder, thunder. Thunder. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 136592228, "title": "Let You Down", "artist": "NF", "lyrics": "Feels like we're on the edge right now. I wish that I could say I'm proud. I'm sorry that I let you down. Let you down. All these voices in my head get loud. I wish that I could shut them out. I'm sorry that I let you down. L-l-let you down. . Yeah, I guess I'm a disappointment. Doing everything I can, I don't wanna make you disappointed. It's annoying. I just wanna make you feel like everything I ever did wasn't ever tryna make an issue for you. But, I guess the more you. Thought about everything, you were never even wrong in the first place, right?. Yeah, I'ma just ignore you. Walking towards you, with my head down, lookin' at the ground, I'm embarrassed for you. Paranoia, what did I do wrong this time? That's parents for you. Very loyal?. Shoulda had my back, but you put a knife into my hands before. What else should I carry for you?. I cared for you, but. . Feels like we're on the edge right now. I wish that I could say I'm proud. I'm sorry that I let you down. L-l-let you down. All these voices in my head get loud. I wish that I could shut them out. I'm sorry that I let you down. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144205755, "title": "For You (Fifty Shades Freed)", "artist": "Liam Payne feat. Rita Ora", "lyrics": "In your eyes, I'm alive. Inside you're beautiful. Something so unusual. In your eyes. I know I'm home. Every tear, every fear. Gone with the thought of you. Changing what I thought I knew. I'll be yours for a thousand lives. . I'm free as a bird. Flying in your cage. I'm diving in deep. And I'm riding with no brakes. And I'm bleeding in love. You're swimming in my veins. You got me now. . Been waiting for a lifetime for you. Been breaking for a lifetime for you. Wasn't looking for love 'till I found you. Ooh na-na ayy. For love, 'till I found you (oh). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 143930744, "title": "All The Stars", "artist": "Kendrick Lamar feat. SZA", "lyrics": "Love, let's talk about love. Is it anything and everything you hoped for?. Or do the feeling haunt you?. I know the feeling haunt you. . This may be the night that my dreams might let me know. All the stars approach you, all the stars approach you, all the stars approach you. This may be the night that my dreams might let me know. All the stars are closer, all the stars are closer, all the stars are closer. . . Tell me what you gon' do to me. Confrontation ain't nothin' new to me. You can bring a bullet, bring a sword, bring a morgue. But you can't bring the truth to me. Fuck you and all your expectations. I don't even want your congratulations. I recognize your false confidence. And calculated promises all in your conversation. I hate people that feel entitled. Look at me crazy 'cause I ain't invite you. Oh, you important?. You the moral to the story? You endorsin'?. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 132633878, "title": "Marry Me", "artist": "Thomas Rhett", "lyrics": "She wants to get married, she wants it perfect. She wants her granddaddy preaching the service. Yeah, she wants magnolias out in the country. Not too many people, save her daddy some money. . Ooh, she got it all planned out. Yeah, I can see it all right now. . I'll wear my black suit, black tie, hide out in the back. I'll do a strong shot of whiskey straight out the flask. I'll try to make it through without crying so nobody sees. Yeah, she wanna get married. But she don't wanna marry me. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 142505108, "title": "River", "artist": "Eminem feat. Ed Sheeran", "lyrics": "I've been a liar, been a thief. Been a lover, been a cheat. All my sins need holy water, feel it washing over me. Well, little one, I don't want to admit to something. If all it's gonna cause is pain. Truth and my lies right now are falling like the rain. So let the river run. . He's comin' home with his neck scratched, to catch flack. Sweat jackets and dress slacks, mismatched. On his breath's Jack, he's a sex addict. And she just wants to exact revenge and get back. It's a chess match, she's on his back like a jet-pack. She's kept track of all his Internet chats. And guess who just happens to be movin' on to the next. Actually, just shit on my last chick and she has what my ex lacks. 'Cause she loves danger, psychopath. And you don't fuck with no man's girl, even I know that. But she's devised some plan to stab him in the back. Knife in hand, says their relationship's hangin' by a strand. So she's been on the web lately. Says maybe she'll be my Gwen Stacy, to spite her man. And I know she's using me to try to play him, I don't care. Hi Suzanne, but I shoulda said \"Bye Suzanne\". After the first night, but tonight I am. . I've been a liar, been a thief. Been a lover, been a cheat. All my sins need holy water, feel it washing over me. Well, little one, I don't want to admit to something. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 142504976, "title": "Never Be the Same", "artist": "Camila Cabello", "lyrics": "Something must've gone wrong in my brain. Got your chemicals all in my veins. Feeling all the highs, feeling all the pain. Let go on the wheel, it's the bullet lane. Now I'm seeing red, not thinking straight. Blurring all the lines, you intoxicate me. . Just like nicotine, heroin, morphine. Suddenly, I'm a fiend and you're all I need. All I need, yeah, you're all I need. . It's you, babe. And I'm a sucker for the way that you move, babe. And I could try to run, but it would be useless. You're to blame. Just one hit of you, I knew I'll never be the same. It's you, babe. And I'm a sucker for the way that you move, babe. And I could try to run, but it would be useless. You're to blame. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 143930783, "title": "Filthy", "artist": "Justin Timberlake", "lyrics": "Hey, if you know what's good. If you know what's good. If you know what's good. If you know what's good. Hey, if you know what's good. If you know what's good. . Haters gonna say it's fake. So real. Haters gonna say it's fake. So real. Haters gonna say it's fake. So real. All my haters gonna say it's fake. I guess, I got my swagger back. . I said, put your filthy hands all over me. You know this ain't the clean version. And what you gonna do with all that meat?. Cooking up a mean serving, huh. . No question, I want it, fire up, everybody smoking. Your friends,. my friends and they ain't leaving till six in the morning. Six in the morning. Come chill, baby, you the coldest, go for them, put them on notice. You don't wanna walk through here. . Baby, don't you mind if I do, yeah. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 129576336, "title": "Whatever It Takes", "artist": "Imagine Dragons", "lyrics": "Falling too fast to prepare for this. Tripping in the world could be dangerous. Everybody circling is vulturous. Negative, Nepotist. . Everybody waiting for the fall of man. Everybody praying for the end of times. Everybody hoping they could be the one. I was born to run, I was born for this. . Whip, whip. Run me like a race horse. Hold me like a rip cord. Break me down and build me up. I wanna be the slip, slip. Word upon your lip, lip. Letter that you rip, rip. Break me down and build me up. . Whatever it takes. Cause I love the adrenaline in my veins. I do whatever it takes. Cause I love how it feels when I break the chains. Whatever it takes. Ya take me to the top, I'm ready for. Whatever it takes. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 128565618, "title": "Broken Halos", "artist": "Chris Stapleton", "lyrics": "Seen my share of. Broken halos. Folded wings that used to fly. They've all gone. Wherever they go. Broken halos that used to shine. . Angels come down. From the heavens. Just to help us on our way. Come to teach us. Then they leave us. And they find some other soul to save. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 137041994, "title": "Heaven", "artist": "Kane Brown", "lyrics": "This is perfect. Come kiss me one more time. I couldn't dream this up. Even if i tried. You and me in this moment. Feels like magic only. I'm right where I wanna be. . Everybody's talking about heaven like they just can't wait to go. Saying how it's gonna be so good, so beautiful. Lying next to you, in this bed with you, I ain't convinced. Cause, I don't know how, I don't know how heaven, heaven. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 123680403, "title": "No Roots", "artist": "Alice Merton", "lyrics": "I like digging holes and hiding things inside them. When I'll grow old I hope I won't forget to find them. 'Cause I've got memories and travel like gypsies in the night. . I built a home and wait for someone to tear it down. Then pack it up in boxes, head for the next town running. 'Cause I've got memories and travel like gypsies in the night. . And a thousand times I've seen this road,. A thousand times. . I've got no roots, but my home was never on the ground. I've got no roots, but my home was never on the ground. I've got no roots uh uh uh uh. I've got no roots uh uh uh uh. . I've got no roots, but my home was never on the ground. I've got no roots, but my home was never on the ground. I've got no roots uh uh uh uh. I've got no roots uh uh uh uh. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 129279958, "title": "Feel It Still", "artist": "Portugal. The Man", "lyrics": "Can't keep my hands to myself. Think I'll dust 'em off, put 'em back up on the shelf. In case my little baby girl is in need. Am I coming out of left field?. . . Ooh woo, I'm a rebel just for kicks, now. I been feeling it since 1966, now. Might be over now, but I feel it still. Ooh woo, I'm a rebel just for kicks, now. Let me kick it like it's 1986, now. Might be over now, but I feel it still. . . Got another mouth to feed. Leave it with a baby sitter, mama, call the grave digger. Gone with the fallen leaves. Am I coming out of left field?. . . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 128055089, "title": "Bad At Love", "artist": "Halsey", "lyrics": "Got a boy back home in Michigan. And it tastes like Jack when I'm kissing him. So I told him that I never really liked his friends. Now he's gone and he's calling me a bitch again. It's a guy that lives in the garden state. And he told me that we'd make it 'til we graduate. So I told him that the music would be worth the wait. But he wants me in the kitchen with a dinner plate. . I believe, I believe, I believe, I believe that we're meant to be. But jealousy, jealousy, jealousy, jealousy get the best of me. Look, I don't mean to frustrate, but I. Always make the same mistakes, yeah. Always make the same mistakes 'cause. . I'm bad at love (ooh-ooh). But you can't blame me for tryin'. You know I'd be lyin' sayin'. You were the one (ooh-ooh). That could finally fix me. Lookin' at my history. I'm bad at love. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 136765439, "title": "rockstar", "artist": "Post Malone feat. 21 Savage", "lyrics": "Hahahahaha. . Tank God. Ayy, ayy. . I've been fuckin' hoes and poppin' pillies. Man, I feel just like a rockstar (star, ayy, ayy). All my brothers got that gas. . And they always be smokin' like a Rasta (-sta). Fuckin' with me, call up on a Uzi. And show up, name them the shottas (-tas). . When my homies pull up on your block. . They make that thing go grrra-ta-ta-ta (ta, pow, pow, pow, ayy, ayy). . Switch my whip, came back in black. I'm startin' sayin', \"Rest in peace to Bon Scott\" (Scott, ayy). Close that door, we blowin' smoke. She ask me light a fire like I'm Morrison (-son, ayy). Act a fool on stage. . Prolly leave my fuckin' show in a cop car (car, ayy). Shit was legendary. Threw a TV out the window of the Montage. Cocaine on the table, liquor pourin', don't give a damn. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 145462519, "title": "FRIENDS", "artist": "Marshmello feat. Anne-Marie", "lyrics": "Oo-oo-oo-oo-oo. Oo-oo-oo-oo-oo. You say you love me, I say you're crazy. We're nothing more than friends. You're not my lover, more like a brother. I know you since we were like ten, yeah. Don't mess it up, talking that shit. Only gonna push me away, that's it. When you say you love me, that make me crazy. Here we go again. Don't go look at me with that look in your eye. You really ain't going nowhere without a fight. You can't be reasoned when I'm done being polite. I've told you 1, 2, 3, 4, 5, 6 thousand times. Have I not made it obvious?. Have I not made it clear?. Want me to spell it out for you?. F-R-I-E-N-D-S. Have I not made it obvious?. Have I not made it clear?. Want me to spell it out for you?. F-R-I-E-N-D-S. F-R-I-E-N-D-S. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 137955069, "title": "How Long", "artist": "Charlie Puth", "lyrics": "Alright. Ooh, yeah. . I'll admit, I was wrong, what else can I say, girl?. Can't you blame my head and not my heart?. I was drunk, I was gone, that don't make it right, but. I promise there were no feelings involved, mmh. . She said, \"Boy, tell me honestly. Was it real or just for show?\", yeah. She said, \"Save your apologies. Baby, I just gotta know\". . How long has this been goin' on?. You been creepin' 'round on me. While you callin' me \"baby\". How long has this been goin' on?. You been actin' so shady (shady). I've been feelin' it lately, baby. . Ooo-oh (yeah). Ooo-oh (encore). Oooh-ooh-oh. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 114736630, "title": "CAN'T STOP THE FEELING!", "artist": "Justin Timberlake", "lyrics": "I got this feeling inside my bones. It goes electric, wavey when I turn it on. All through my city, all through my home. We're flying up, no ceiling, when we in our zone. . I got that sunshine in my pocket. Got that good song in my feet. I feel that hot blood in my body when it drops. I can't take my eyes up off it, moving so phenomenally. You gone like the way we rock it, so don't stop. . Under the lights when everything goes. Nowhere to hide when I'm getting you close. When we move, well, you already know. So just imagine, just imagine, just imagine. Nothing I can see but you when you dance, dance, dance. Feeling good, good, creeping up on you. So just dance, dance, dance, come on. All those things I should do to you. But you dance, dance, dance. And ain't nobody leaving soon, so keep dancing. . I can't stop the feeling. So just dance, dance, dance. I can't stop the feeling. So just dance, dance, dance, come on. . Ooh, it's something magical. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 139918380, "title": "Him & I", "artist": "G-Eazy feat. Halsey", "lyrics": "Cross my heart, hope to die. To my lover, I'd never lie. He said \"be true,\" I swear I'll try. In the end, it's him and I. He's out his head, I'm out my mind. We got that love, the crazy kind. I am his, and he is mine. In the end, it's him and I, him and I. . My '65 speeding up the PCH, a hell of a ride. They don't wanna see us make it, they just wanna divide. 2017 Bonnie and Clyde. Wouldn't see the point of living on if one of us died, yeah. Got that kind of style everybody try to rip off. YSL dress under when she takes the mink off. Silk on her body, pull it down and watch it slip off. Ever catch me cheating, she would try to cut my (ha-ha-ha). Crazy, but I love her, I could never run from her. Hit it, no rubber never would let no one touch her. Swear we drive each other, mad, she be so stubborn. But, what the fuck is love with no pain, no suffer. Intense, this shit, it gets dense. She knows when I'm out of it like she could just sense. If I had a million dollars or was down to ten cents. She'd be down for whatever, never gotta convince (you know?). . Cross my heart, hope to die. To my lover, I'd never lie (I love you baby). He said \"be true,\" I swear I'll try. In the end, it's him and I. He's out his head, I'm out my mind. We got that love; the crazy kind. I am his, and he is mine. In the end, it's him and I. . Him and I. Woah-oh-oh-oh-oh. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 137945443, "title": "Most People Are Good", "artist": "Luke Bryan", "lyrics": "I believe kids oughta stay kids as long as they can. Turn off the screen, go climb a tree, get dirt on their hands. I believe we gotta forgive and make amends. Cause nobody gets a second chance to make new old friends. I believe in working hard for what you've got. Even if it don't add up to a hell of a lot. . I believe most people are good. And most Mama's oughta qualify for sainthood. I believe most Friday nights. Look better underneath neon stadium lights. I believe you love who you love. Ain't nothing you should ever be ashamed of. I believe this world ain't half as bad as it looks. I believe most people are good. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 116237765, "title": "I Fall Apart", "artist": "Post Malone", "lyrics": "Oooh, I fall apart. Oooh, yeah, mmhmm. . She told me that I'm not enough, yeah. And she left me with a broken heart, yeah. She fooled me twice and it's all my fault, yeah. She cut too deep, now she left me scarred, yeah. Now there's too many thoughts goin' through my brain, yeah. And now I'm takin' these shots like it's Novocaine, yeah. . Oooh, I fall apart. Down to my core. Oooh, I fall apart. Down to my core. Oooh, didn't know it before. Surprised when you caught me off guard. All this damn jewelry I bought. You was my shorty, I thought. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 139200978, "title": "This Is Me", "artist": "Keala Settle feat. The Greatest Showman Ensemble", "lyrics": "I am not a stranger to the dark. Hide away, they say. 'Cause we don't want your broken parts. I've learned to be ashamed of all my scars. Run away\", they say. No one'll love you as you are. . But I won't let them break me down to dust. I know that there's a place for us. For we are glorious. . When the sharpest words wanna cut me down. I'm gonna send a flood, gonna drown them out. I am brave, I am bruised. I am who I'm meant to be, this is me. Look out 'cause here I come. And I'm marching on to the beat I drum. I'm not scared to be seen. I make no apologies, this is me. . Oh-oh-oh-oh. Oh-oh-oh-oh. Oh-oh-oh-oh. Oh-oh-oh-oh. Oh-oh-oh, oh-oh-oh, oh-oh-oh, oh, oh. . Another round of bullets hits my skin. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 114324468, "title": "New Rules", "artist": "Dua Lipa", "lyrics": "One, one, one, one, one. . Talking in my sleep at night. Making myself crazy. (Out of my mind, out of my mind). . Wrote it down and read it out. Hoping it would save me. (Too many times, too many times). . My love. He makes me feel like nobody else. Nobody else. . But my love. He doesn't love me, so I tell myself. I tell myself. . One: Don't pick up the phone. . You know he's only calling 'cause he's drunk and alone. . Two: Don't let him in. . You'll have to kick him out again. . Three: Don't be his friend. . You know you're gonna wake up in his bed in the morning. . And if you're under him. You ain't getting over him. . I got new rules - I count 'em. I got new rules - I count 'em. I gotta tell them to myself. I got new rules - I count 'em. I gotta tell them to myself. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 139141805, "title": "Wolves", "artist": "Selena Gomez feat. Marshmello", "lyrics": "In your eyes, there's a heavy blue. One to love and one to lose. Sweet divine, a heavy truth. Water or wine, don't make me choose. . I wanna feel the way that we did that summer night. Night (ah-ah). Drunk on a feeling, alone with the stars in the sky. . I've been running through the jungle. I've been running with the wolves. To get to you, to get to you. . I've been down the darkest alleys. Saw the dark side of the moon. To get to you, to get to you. . I've looked for love in every stranger. Took too much to ease the anger. All for you, yeah, all for you. . I've been running through the jungle. I've been crying with the wolves. To get to you. To get to you, oh, to get to you. . •••. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 134319903, "title": "End Game", "artist": "Taylor Swift feat. Ed Sheeran & Future", "lyrics": "I wanna be your end game. I wanna be your first string. I wanna be your A-Team. I wanna be your end game, end game. . Big reputation, big reputation. Oh, you and me, we got big reputations. Ah, and you heard about me. Oh, I got some big enemies (Yeah). . Big reputation, big reputation. Oh, you and me would be a big conversation. Ah, and I heard about you (Yah). Oh, you like the bad ones, too. . You so dope, don't overdose, I'm so stoked, I need a toast. We do the most, I'm in the Ghost like I'm whippin' a boat. I got a reputation, girl, that don't precede me (Yah). I'm a call away whenever you need me (Yeah). . I'm in a G5 (yeah), come to the A-Side (Yeah). I got a bad boy persona, that's what they like (What they like). You love it, I love it, too, 'cause you my type (You my type). You hold me down and I protect you with my life. . I don't wanna touch you, I don't wanna be. Just another ex-love you don't wanna see. I don't wanna miss you (I don't wanna miss you). Like the other girls do. . I don't wanna hurt you, I just wanna be. Drinking on a beach with you all over me. I know what they all say (I know what they all say). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 137042404, "title": "You Broke Up with Me", "artist": "Walker Hayes", "lyrics": "Hey. . Well I got some coke in my bourbon. Surfin' the room like Swazye. No, I ain't drunk, I'm amazin'. Yeah, I got that laid way way back back in my swagger. Xfactor feeling no pain. I'm at the top of my game. . Darlin' you can't crash my party with your \"sorry's\" and \"what are we's\". Dont start rainin' on my Mardi Gras parade for a minute. I ain't even fixin' to listen to your guilt trippin'. You're forgettin' girl you made your bed and didn't want me in it. (Hey!). Woah girl, simmer on down a notch. . Ain't nobody makin' you watch me get my forget you on. No girl, can't touch my good as gold. I know it's difficult to see me on a roll. (Hey!). But hey, you broke up with me. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 137949333, "title": "Wait", "artist": "Maroon 5", "lyrics": "Dirty looks from your mother. Never seen you in a dress that color, no. It's a special occasion. Not invited but I'm glad I made it. . Oh, let me apologize. I'll make up, make up, make up, make up for all those times. Your love, I don't wanna lose. I'm beggin', beggin', beggin', beggin', begging you. . Wait, can you turn around, can you turn around?. Just wait, can we work this out, can we work this out?. Just wait, can you call me please? 'Cause I wanna be with you. Oh, wait, can you turn around, can you turn around?. Just wait, can we work this out, can we work this out?. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144225806, "title": "Five More Minutes", "artist": "Scotty McCreery", "lyrics": "Eight years old, couple cane poles sittin' down by the creek. Lines in the water, watchin' those bobbers, seein' that red sun sink. Mama's on the porch yellin' \"supper hot! Ya'll come and get it!\". We yelled \"five more minutes\". At sixteen, it was 12: 03 standing at her front door. Katie's dad said midnight but we needed just a little more. Yellow light flippin' on and off interupting that good night kissin'. We wanted five more minutes. Time rolls by the clock don't stop. I wish I had a few more drops. Of the good stuff, the good times. Oh but they just keep on flying right on by. Like it ain't nothing. I wish I had me a pause button. Moments like those Lord knows I'd hit it. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 131772376, "title": "Written in the Sand", "artist": "Old Dominion", "lyrics": "Turn me on, turn me off, then you turn me back on by the weekend. And you won't say the words that I want but you flirt when you're drinkin'. I see those bubbles pop up like you're texting then they disappear. Let's cut through the shit and let's get to what we're doing here. . Are we just a backseat, tryna get it while we can?. Are we names in a tattoo, or just a number on a hand?. Are we last-call kissing or will we be reminiscing. With each other for the next forty years?. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 136592212, "title": "Let Me Go", "artist": "Hailee Steinfeld feat. Alesso, Florida Georgia Line & watt", "lyrics": "You made plans and I, I made problems. We were sleeping back to back. We know this thing wasn't built to last. Good on paper, picture perfect. Chased the high too far, too fast. Picket white fence, but we paint it black. . Ooh, and I wished you would hurt me harder than I hurt you. Ooh, and I wish you wouldn't wait for me but you always do. . I've been hoping somebody loves you in the ways I couldn't. Somebody's taking care of all of the mess I made. Someone you don't have to change. I've been hoping. Someone will love you, let me go. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 82774259, "title": "Tennessee Whiskey", "artist": "Chris Stapleton", "lyrics": "Used to spend my nights out in a barroom. Liquor was the only love I've known. But you rescued me from reachin' for the bottom. And brought me back from being too far gone. . You're as smooth. As Tennessee whiskey. You're as sweet. As strawberry wine. You're as warm. As a glass of brandy. And honey, I stay stoned on your love. All the time. . I've looked for love in all the same old places. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 129576420, "title": "Believer", "artist": "Imagine Dragons", "lyrics": "First things first. I'mma say all the words inside my head. I'm fired up and tired of the way that things have been, oh-ooh. The way that things have been, oh-ooh. Second thing second. Don't you tell me what you think that I can be. I'm the one at the sail, I'm the master of my sea, oh-ooh. The master of my sea, oh-ooh. . I was broken from a young age. Taking my sulking into the masses. Write down my poems for the few. That looked at me Took to me, shook to me, feeling me. Singing from heart ache from the pain. Take up my message from the veins. Speaking my lesson from the brain. Seeing the beauty through the.... . Pain!. You made me a, you made me a believer, believer. Pain!. You break me down, you build me up, believer, believer. Pain!. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144205758, "title": "Heaven", "artist": "Julia Michaels", "lyrics": "Love's my religion. But he was my faith. Something so sacred. So hard to replace. Falling for him was like falling from grace. All wrapped in one. He was so many sins. Would have done anything. Everything for him. And if you ask me. I would do it again. . No need to imagine. 'Cause I know it's true. They say all good boys go to Heaven. But bad boys bring Heaven to you. It's automatic. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 131027659, "title": "Bodak Yellow", "artist": "Cardi B", "lyrics": "KSR. It's Cardi, ayy. Said, \"I'm the shit, they can't fuck with me if they wanted to\". . . Said, \"Lil bitch, you can't fuck with me if you wanted to\". These expensive, these is red bottoms, these is bloody shoes. Hit the store, I can get 'em both, I don't wanna choose. And I'm quick, cut a nigga off, so don't get comfortable, look. I don't dance now, I make money moves. Say I don't gotta dance, I make money move. If I see you and I don't speak, that means I don't fuck with you. I'm a boss, you a worker, bitch, I make bloody moves. . . Now she say she gon' do what to who? Let's find out and see. Cardi B, you know where I'm at, you know where I be. You in the club just to party, I'm there, I get paid a fee. I be in and out them banks so much, I know they're tired of me. Honestly, don't give a fuck 'bout who ain't fond of me. Dropped two mixtapes in six months, what bitch working as hard as me?. I don't bother with these hoes, don't let these hoes bother me. They see pictures, they say, \"Goals,\" bitch, I'm who they tryna be. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 125673808, "title": "Young Dumb & Broke", "artist": "Khalid", "lyrics": "So you're still thinking of me. Just like I know you should. I cannot give you everything. You know I wish I could. . I'm so high at the moment. I'm so caught up in this. Yeah, we're just young, dumb and broke. But we still got love to give. . While we're young, dumb. Young, young, dumb and broke. Young, dumb. Young, young, dumb and broke. Young, dumb. Young, young dumb and broke. Young dumb broke high school kids. . Ya-da-da-da-da-da-da-da. Ya-da-da-da-da-da-da. Ya-da-da-da-da-da-da-da. Young, dumb, broke high school kids. . We have so much in common. We argue all the time. You always say I'm wrong. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 141642279, "title": "Lemon", "artist": "N.E.R.D & Rihanna", "lyrics": "The truth will set you free. But first, it'll piss you off (hate!). . Bad bitches wanna be my bae. (Hate!) Hunt me down like the C.I.A. (Hate!) Side of my car, tryna see my face. (Hate!) Want me to beat it like the T.I. case. Oh (hate!) and if it's heated I'ma feed my face. (Hate!) And best believe, it's gon' be outrageous. (Hate!) Hatin' niggas can't believe my race. (Hate!) Niggas hit you with the Eli face, oh.... . Bouncin' around, bouncin' around, bouncin'. Bouncin' around, bouncin' around, bouncin'. Scrunchin' their eyes with your name in their mouth and. Bouncin' around, bouncin' around, bouncin'. . (Hate!) You keep askin' me where I'm from. (Hate!) About the borders and, \"Did I run?\". (Hate!) Keep askin' how I feel 'bout guns. There's a light (hate!) and dark army, which side you choose?. Oh (hate!) If not now then when?. (Hate!) And if not me then who?. (Hate!) Don't drink the Kool-Aid, my friends. (Hate!) I tried to tell y'all about this dude. . Bouncin' around, bouncin' around, bouncin'. Bouncin' around, bouncin' around, bouncin'. Hate supplements are found right in their couches. Bouncin' around, bouncin' around, bouncin'. . (Wait, wait a minute) Shout out to them people. People (wait, wait a minute) p-p-p-people, people.... (Wait, wait a minute) Mad ethnic right now. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 134281515, "title": "Tell Me You Love Me", "artist": "Demi Lovato", "lyrics": "Oh no, here we go again. Fighting over what I said. I'm sorry, yeah I'm sorry. Bad at love, no, I'm not good at this. But I can't say I'm innocent. Not hardly, but I'm sorry. . And all my friends, they know and it's true. I don't know who I am without you. I got it bad, baby. Got it bad. . Oh, tell me you love me. I need someone on days like this, I do. On days like this. Oh, tell me you love me. I need someone. On days like this, I do. On days like this. Oh, can you hear my heart say. Oh oh oh oh oh oh, oh oh oh oh oh oh. No, you ain't nobody 'til you got somebody. You ain't nobody 'til you got somebody. . And I hope I never see the day. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 128520456, "title": "LOVE.", "artist": "Kendrick Lamar fEAT. ZACARI.", "lyrics": "Damn. Love or lust. Damn. All of us. . Give me a run for my money. There is nobody, no one to outrun me. So give me a run for my money. Sipping bubbly, feeling lovely, living lovely. Just love me. I wanna be with you, ayy, I wanna be with. I wanna be with you, ayy, I wanna be with. I wanna be with you. . If I didn't ride blade on curb, would you still (love me). If I made up my mind at work would you still (love me). Keep it a hundred, I'd rather you trust me than to (love me). Keep it a whole one hund', don't got you I got nothing. . Ay, I got something (I got something). Hol' up, we gon' function, no assumptions. Feeling like Tyson wit' it, knock it out out twice. I'm with it, only for the night, I'm kidding. Only for life, you're a homie for life. You're a homie for life, let's get it. Hit that shoulder lean, I know what comin' over mean. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 137519140, "title": "One Foot", "artist": "WALK THE MOON", "lyrics": "Ooh-ooh-ooh (hey!). Ooh-ooh-ooh (hey!). . Not a soul up ahead and nothing behind. There's a desert in my blood and a storm in your eyes. Am I the king of nothing at all?. And you're the queen of nothing at all. But I remember the fight and I forget the pain. I got my hand in your pocket and my key in your chain. Am I the king of nothing at all?. And you're the queen of nothing at all. . Oh, through the wilderness. You and I will walk into the emptiness. Oh, and my heart is a mess. Is it the only defense against the wilderness?. . Well, cross my heart and hope to die. Taking this one step at a time. I got your back if you got mine. Oh, one foot in front of the other. Ooh-ooh-ooh (hey!). One foot in front of the other. Ooh-ooh-ooh (hey!). One foot in front of the other. . One foot in front of the other. Ooh, all that we have is each other. One foot in front of the other. . Well, cross my heart and hope to die. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144205754, "title": "Capital Letters", "artist": "Hailee Steinfeld feat. BloodPop®", "lyrics": "Never was a leader. Never had a thing for fairytales. Not really a believer, oh-oh. Small voice in the quiet. Guess I never dared to know myself. Can my heart beat quiet? No. . But then there was you. (But then there was you). Yeah, then there was you. Pull me out of the crowd. You were telling the truth. (You were telling the truth). Yeah (yeah, yeah). I got something to say now. 'Cause you tell me that there's no way I couldn't go. Nothing I couldn't do. Yeah. . I want to get louder. I got to get louder. We 'bout to go up baby, up we go. We 'bout to go up baby, up we go. We're blowing out speakers. Our heart a little clearer. We 'bout to go up baby, up we go. We 'bout to go up baby, up we go. . For worst or for better. Gonna give it to you. In capital letters. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 138350515, "title": "Mine", "artist": "Bazzi", "lyrics": "Huh, yeah, naw I just, had a lil' bit too much of Hennessy. Just gotta tell you how I feel, look. . You so fuckin' precious when you smile. Hit it from the back and drive you wild. Girl, I lose myself up in those eye-eye-eye-eye-eyes. I just had to let you know you're mine. . Hands on your body, I don't wanna waste no time. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144205760, "title": "Never Tear Us Apart", "artist": "Bishop Briggs", "lyrics": "Don't ask me what you know is true. Don't have to tell you, oh, I love your precious heart. . I was standing, you were there. Two worlds collide. And they could never, ever tear us apart. . And we could live for a thousand years. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 115316437, "title": "Lights Down Low", "artist": "MAX feat. gnash", "lyrics": "Heaven only knows where you've been. But I don't really need to know. I know where you're gonna go. . On my heart where you're resting your head. And you just look so beautiful. Just like you were an angel. . Can I stop the flow of time?. Can I swim in your divine?. 'Cause I don't I think I'd ever leave this place. . Oh. Turn the lights, turn the lights down low. Yeah. Now I'm feeling you breathing slow. . 'Cause, baby, we're just reckless kids. Trying to find an island in the flood. Oh. Just turn the lights, turn the lights down low. Oh. . Moonlight, mood lights, moves like J-Lo. Tell me what you want from me, I'll do it if you say so. 'Cause you're the only one for me, I'm never gonna say no. I found me an angel, I can see it in your halo. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 134281599, "title": "Good Old Days", "artist": "Macklemore feat. Kesha", "lyrics": "I wish somebody would have told me, babe. Someday, these will be the good old days. All the love you won't forget. And all these reckless nights you won't regret. Someday soon, your whole life's gonna change. You'll miss the magic of these good old days. . I was thinkin' 'bout the band. I was thinkin' 'bout the fans. We were underground. Loadin' merch in that 12-passenger van. In a small club in Minnesota. And the snow outside of 1st Ave. I just wanted my name in a star. Now look at where we at. Still growin' up, still growin' up. I would lay in my bed and dream about what I'd become. Couldn't wait to get older, couldn't wait to be some. Now that I'm here, wishing I was still young. Those good old days. . I wish somebody would have told me, babe. That someday, these will be the good old days. All the love you won't forget. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 137303641, "title": "Boy", "artist": "Lee Brice", "lyrics": "Boy, you're gonna know it all. You'll think you're ten feet tall. And run like you're bulletproof. And total a car or two. Boy, you're gonna hate this town. Wish you could burn it down. That fire in your eyes is 20 counties wide. But boy, you're gonna love 17. And boy, you'll do some stupid things. . You're gonna drive and kiss. And throw a punch. And grow up way too fast. You're gonna drop the ball. Hit the wall. And break some hearts like glass. I know you will, 'cause you're a part of me. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 124985077, "title": "Shape of You", "artist": "Ed Sheeran", "lyrics": "The club isn't the best place to find a lover. So the bar is where I go. Me and my friends at the table doing shots. Drinking fast, and then we talk slow. . And you come over and start up a conversation with just me. And trust me, I'll give it a chance now. Take my hand, stop. Put \"Van the Man\" on the jukebox. And then we start to dance. And now I'm singing like. . Girl, you know I want your love. Your love was handmade for somebody like me. Come on now, follow my lead. I may be crazy, don't mind me. . Say: \"Boy, let's not talk too much. Grab on my waist and put that body on me\". Come on now, follow my lead. Come, come on now, follow my lead. . I'm in love with the shape of you. We push and pull like a magnet do. Although my heart is falling too. I'm in love with your body. Last night you were in my room. And now my bed sheets smell like you. Every day discovering something brand new. . Oh, I'm in love with your body. Oh-i-oh-i-oh-i-oh-i. Oh, I'm in love with your body. Oh-i-oh-i-oh-i-oh-i. Oh, I'm in love with your body. Oh-i-oh-i-oh-i-oh-i. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 128954467, "title": "One Number Away", "artist": "Luke Combs", "lyrics": "Are you sitting at home all alone trying to fall asleep?. Are you staring a hole through your phone praying that it rings?. Are you watching a movie that you've seen a thousand times?. Maybe playing some Mayer getting lost in your favorite lines?. . If you're anything like me. You just might be doing whatever it takes to drown out the noise. But I just wanna hear your voice. . And I'm one number away from calling to you. I said I was through, but I'm dying, inside. Got my head in a mess, girl I confess. I lied when I said, \"I'm leaving and not coming back\". Might be the whiskey or the midnight rain. But everywhere I go I see your face. In my brain, dial it up, everything I want to say. But I'm still one number away. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 143930755, "title": "Big Shot", "artist": "Kendrick Lamar feat. Travis Scott", "lyrics": "I'm just another body down. internal bleeding round & round. & all I can think of are ways to die alone. & all I can think of are ways to die alone. . A portrait of my skeletal gain. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 141974861, "title": "Perfect Duet (with Beyoncé)", "artist": "Ed Sheeran", "lyrics": "I found a love for me. Oh darling, just dive right in and follow my lead. Well, I found a girl beautiful and sweet. Oh, I never knew you were the someone waiting for me. . 'Cause we were just kids when we fell in love. Not knowing what it was, I will not give you up this time. But darling, just kiss me slow, your heart is all I own. And in your eyes, you're holding mine. . Baby, I'm dancing in the dark with you between my arms. Barefoot on the grass, listening to our favorite song. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 131759132, "title": "Praying", "artist": "Ke$ha", "lyrics": "Well, you almost had me fooled. Told me that I was nothing without you. Oh, but after everything you've done. I can thank you for how strong I have become. . 'Cause you brought the flames and you put me through hell. I had to learn how to fight for myself. And we both know all the truth I could tell. I'll just say this is I wish you farewell. . I hope you're somewhere praying, praying. I hope your soul is changing, changing. I hope you find your peace. Falling on your knees, praying. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 143930751, "title": "King's Dead", "artist": "Jay Rock feat. Kendrick Lamar, Future & James Blake", "lyrics": "You gave it all for me. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 145553489, "title": "Plug Walk", "artist": "Rich The Kid", "lyrics": "Ayy, ayy, plug walk (plug walk, plug, plug). I don't even understand how the fuck my plug talk (huh? what, what?). Pick him up in a space coupe,. I don't let my plug walk (skrrt, pull up in a space coupe). New freak, had to cut my other lil' bitch off (ooh, ooh, lil' bitch). 50K, you could come and book a nigga for a plug walk. . You can't reach me (what?), space coupe like E.T. It's the plug tryna call me (skrrt, skrrt). I was up trappin' early in the morning (plug). Ooh, on the wave like a du-rag (du-rag). Pussy nigga callin' for his boo back (pussy). Plug walk, Gucci on my shoe racks (Gucci). Walk up in the house with a rat-a-tat. 'Til I ran into the plug ('til I ran into the plug). 'Til I ran into the mud (to the mud). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 139922321, "title": "Everything's Gonna Be Alright", "artist": "David Lee Murphy & Kenny Chesney", "lyrics": "She rattled the ice in my plastic cup. I said \"yes m'am\", fill her up. Tell me something good that I don't know. 'Cause this world's been kicking my behind. Life ain't been a friend of mine. Lately I've been feeling kinda low. And she looked back over her shoulder. Pointed at the sign hanging up on the wall. It said. Everything's gonna be alright. Everything's gonna be alright. And nobody's gotta worry 'bout nothing. Don't go hittin' that panic button. It ain't worth spilling your drink. Everything's gonna be alright. Alright, alright. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144495839, "title": "Dura", "artist": "Daddy Yankee", "lyrics": "Tiritiritiririti-Daddy. (Los nuevos jeda). Cuando yo la vi. Dije: \"si esa mujer fuera para mi\". Perdóname, te lo tenía que decir. Estás dura, dura, dura, dura, dura. Que estás dura, mano arriba porque tú te ves bien. Estás dura mamacita, te fuiste de nivel. Dura, mira como brilla tu piel. Estás dura, dímelo dímelo ¿cómo es que es?. Estás dura, yo te doy un veinte de diez. Estás dura, dura, dura. Tu eres la máquina, la máquina de baile. Si no tiene a nadie vente pa' mi' brazos, caile. Ese perfume se siente en el aire. Algo como Argentina, tú me traes los Buenos Aires. Está poderosa, media escandalosa. Habrán muchas mujeres pero tú eres otra cosa. Si fuera un delito eso de que estás hermosa. Te arresto en mi cama y te pongo las esposas. Tienes el toque, toque, toque. Miren el material, edición especial. Tienes el toque, toque, toque. Perdóname, te lo tenía que decir. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 139014884, "title": "All On Me", "artist": "Devin Dawson", "lyrics": "Yeah I know that the woes and the weight of the world can get inside our minds. And be too much sometimes. I know. But baby don't let the no's and the ups and the downs from the rollercoaster ride. Beat you up inside. Baby don't. . But if you ever feel that way, don't you ever hesitate, 'cause. You got my number you can call on me. If you're in trouble put the fall on me. When you're mad you can take it out on me. When it don't add up you can count on me. When you're low come get high on me. . Make it slow take your time on me. Settle in, let it out. Come and lay on me. When it gets heavy put the weight on me. Baby put it all on me. Put it all on me. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 133541108, "title": "Beautiful Trauma", "artist": "P!nk", "lyrics": "We were on fire. I slashed your tires. It's like we burned so bright, we burned out. I made you chase me. I wasn't that friendly. My love, my drug, we're fucked up, oh. . 'Cause I've been on the run so long, they can't find me. You waken up to remember I'm pretty. And when the chemicals leave my body. Yeah, they're gonna find me in a hotel lobby. 'Cause mmm tough. Times they keep coming, all night. Laughing and fucking. Some days I can barely breathe. After we were high on the love. Don't doubt it was you. . The pill I keep taking. The nightmare I wake in. There's nothing, no nothing, nothing but you. My perfect rock bottom. My beautiful trauma. My love, my love, my drug, oh. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 115144739, "title": "24K Magic", "artist": "Bruno Mars", "lyrics": "Tonight. I just want to take you higher. Throw your hands up in the sky. Let's set this party off right. . Players, put yo' pinky rings up to the moon. Girls, what y'all trying to do?. 24 karat magic in the air. Head to toe soul player. Uh, look out!. . Pop pop, it's show time (Show time). Show time (Show time). Guess who's back again?. Oh they don't know? (Go on tell 'em). Oh they don't know? (Go on tell 'em). I bet they know soon as we walk in (Showin' up). Wearing Cuban links (ya). Designer minks (ya). Inglewood's finest shoes (Whoop, whoop). Don't look too hard. Might hurt ya'self. Known to give the color red the blues. . Ooh shit, I'm a dangerous man with some money in my pocket. (Keep up). So many pretty girls around me and they waking up the rocket. (Keep up). Why you mad? Fix ya face. Ain't my fault y'all be jocking. (Keep up). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144229100, "title": "Up Down", "artist": "Morgan Wallen feat. Florida Georgia Line", "lyrics": "Was Friday after five, I got here just in time. Went ahead and wet a line 'fore I went and lost my mind. I ain't been here long, but the bobbers in the pond. Going up down, up, down, up, down. Tonight, we're gonna raise a whole lot more than Cain. 'Cause there's money in the bank and tomorrow's Saturday. So if they pass that fifth of Jack this way. I turn it up, down, up, down, up, down. . We just holding it down here in BFE. Still rolling around with a burnt CD. Free Bird, five minutes deep. Head bobbing up, down, up, down, up, down. We got what we got, we don't need the rest. Can turn this parking lot into a party. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 143267601, "title": "Bartier Cardi", "artist": "Cardi B feat. 21 Savage", "lyrics": "Bardi in a 'Rari, diamonds all over my body. (30, you a fool for this one). Shinin' all over my body. Bardi, put that lil' bitch on Molly. Bardi. Bitch on Molly. (Cheeze). 21, diamonds all over my body. Fucked that bitch on Molly. (KSR). Ask him if I'm 'bout it. . Your bitch wanna party with Cardi. Cartier Bardi in a 'Rari (21). Diamonds all over my body (Cardi). Shinin' all over my body (my body). Cardi got your bitch on Molly. Bitch, you ain't gang, you lame. Bentley truck lane to lane, blow out the brain (21). I go insane, insane. I drop a check on the chain, fuck up a check in the plane. Cardi took your man, you upset, uh. Cardi got rich, they upset, yeah (from what?). Cardi put the pussy on Offset (say what?). Cartier, Cardi B brain on Offset (21). Cardi took your man, you upset, uh. Cardi got rich, they upset, yeah (21). Cardi put the pussy on Offset (Cardi). Cartier, Cardi B brain on Offset (who's Cardi?).  . . Who get this motherfucker started? (Cardi). Who took your bitch out to party? (Cardi). I took your bitch and departed (Cardi). Who that be fly as a Martian? (Cardi). Who that on fleek in the cut? (Cardi). Who got the bricks in the truck? (Cardi). Them diamonds gon' hit like a bitch on a bitchy ass bitch. Bitch, you a wannabe Cardi. Red bottom MJ. Moonwalk on a bitch, moonwalkin' through your clique. I'm moonwalkin' in the 6. Sticky with the kick, moonrocks in this bitch. I'm from the motherfuckin' Bronx (Bronx). I keep the pump in the trunk (trunk). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 136885594, "title": "Best Friend", "artist": "Sofi Tukker feat. NERVO, The Knocks & Alisa Ueno", "lyrics": "I think that I'll keep loving you, way past sixty-five. We made a language for us two, we don't need to describe. Every time you call on me, I drop what I do. You are my best friend and we've got some shit to shoot. . Do you wanna meet me at the bar? (ya). Do you wanna meet me at the lounge? (ya). Do you wanna meet me in the club? (ya). Do you wanna meet me downtown? (okay). Do you wanna meet me in the east? (ya). Do you wanna meet me in the west? (ya). Do you wanna meet me on the block? (ya). Do you wanna meet me at the spot? (okay). . I think that I'll keep loving you, way past sixty-five. We made a language for us two, we don't need to describe. Every time you call on me, I drop what I do. You are my best friend and we've got some shit to shoot. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144500800, "title": "Zombie", "artist": "Bad Wolves", "lyrics": "Another head hangs lowly. Child is slowly taken. And the violence caused such silence. Who are we mistaken?. . But you see, it's not me. It's not my family. In your head, in your head, they are fightin'. With their tanks, and their bombs. And bombs, and their drones. In your head, in your head, they are cryin'. . What's in your head, in your head. Zombie, zombie, zombie-ie-ie. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 133541111, "title": "What About Us", "artist": "P!nk", "lyrics": "We are searchlights, we can see in the dark. We are rockets, pointed up at the stars. We are billions of beautiful hearts. And you sold us down the river too far. . What about us?. What about all the times you said you had the answers?. What about us?. What about all the broken happy ever afters?. What about us?. What about all the plans that ended in disaster?. What about love? What about trust?. What about us?. . We are problems that want to be solved. We are children that need to be loved. We were willing, we came when you called. But man, you fooled us, enough is enough, oh. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 137945390, "title": "Too Good at Goodbyes", "artist": "Sam Smith", "lyrics": "You must think that I'm stupid. You must think that I'm a fool. You must think that I'm new to this. But I have seen this all before. . I'm never gonna let you close to me. Even though you mean the most to me. 'Cause every time I open up, it hurts. So I'm never gonna get too close to you. Even when I mean the most to you. In case you go and leave me in the dirt. . And every time you hurt me, the less that I cry. And every time you leave me, the quicker these tears dry. And every time you walk out, the less I love you. Baby, we don't stand a chance, it's sad but it's true. . I'm way too good at goodbyes. (I'm way too good at goodbyes). I'm way too good at goodbyes. (I'm way too good at goodbyes). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 131218710, "title": "Yours", "artist": "Russell Dickerson", "lyrics": "I was a boat stuck in a bottle. That never got the chance to touch the sea. Just forgotten on the shelf. No wind in the sails. Going no where with no one but me. I was one in one-hundred billion. A burned out star in a galaxy. Just lost in the sky, wondering why. Everyone else shines out but me. . But. I came to life when I first kissed you. The best me has his arms around you. You make me better than I was before. Thank God, I'm yours. . I was a worn out set of shoes. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 136912525, "title": "No Limit", "artist": "G-Eazy, A$AP Rocky & Cardi B", "lyrics": "If I hit it one time I'ma pipe her. If I hit it two times then I like her. If I fuck three times I'ma wife her. It ain't safe for the black or the white girls. It ain't safe. It ain't safe. It ain't safe. It ain't safe. Tell your man pipe up. Nigga pipe up. Hunnit bands from the safe. In your face, what'd you say?. Money, dance. Turn this shit into a nightclub. . Fuck with me and get some money, yeah ayy. Fuck with me and get some money (ayy). Fuck with me and get some money (ayy). Fuck with G and get some money. . No limit I'm a fucking soldier, ayy. Always lit, yeah I'm never sober. It's been three days in a row, your bitch coming over. Told that bitch to kick rock, she act like it's a boulder, ayy. 'Rari, shopping. Let me, cop it. Always, poppin'. Hella, poppin'. She's a bopper. Homie, hoppin'. Ain't no, stopping. Album, dropping. Got the city on fire. Bitch lying on me like she tired. I might have to fuck around and call Kamaiyah. Hoe stirring up the pot, Jambalaya. Young Gerald. . ì. If I hit it one time I'ma pipe her. If I hit it two times then I like her. If I fuck three times I'ma wife her. It ain't safe for the black or the white girls. It ain't safe. It ain't safe. It ain't safe. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144205757, "title": "High", "artist": "Whethan feat. Dua Lipa", "lyrics": "You don't have to be so cautious. If you practice what you preach. Counting up the stacks on the counter. A fucking (disease). Don't ask me to be righteous. If you practice what you teach. Counting all your blessings. The second you're down on your knees. . So why, why?. Don't we get a little high, high?. . Don't we get a little–. Get a little–. Don't we get a little high. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 142897677, "title": "Perfect Symphony", "artist": "Ed Sheeran feat. Andrea Bocelli", "lyrics": "I found a love for me. Oh darling, just dive right in and follow my lead. Well, I found a girl, beautiful and sweet. Oh, I never knew you were the someone waiting for me. . 'Cause we were just kids when we fell in love. Not knowing what it was, I will not give you up this time. But darling, just kiss me slow, your heart is all I own. And in your eyes, you're holding mine. . Baby, I'm dancing in the dark with you between my arms. Barefoot on the grass, listening to our favourite song. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 139200853, "title": "MotorSport", "artist": "Migos feat. Nicki Minaj & Cardi B", "lyrics": "Yeah, skrrt. M-M-M-Murda. . Motorsport, yeah, put that thing in sports (skrrt, skrrt). Shawty bad (bad), pop it like a cork (pop it). You a dork, never been a sport (dork, yeah). Pull up (woo, woo), jumpin' out the court. Cotton candy (drink), my cup tastes like the fair (cotton). Straight up there (where?) we didn't take the stairs (where?). Faced my fears (fears) gave my mama tears (mama). . Shiftin' gears (shift,) on the Nawf, get serious (serious). . Fix all your fears, then get at me. Hit so many donuts on them backstreets. Sit so high in the nosebleeds (yeah). Feel like I can fly, yeah. Xans, Percy, check (yeah) Bill Belichick. Take the air out the ball, just so I can flex. Take the air out the mall, walkin' with the sacks. Take the air out your broad (hey), now she can't go back. Xans, Percy, check (yeah) Bill Belichick. Take the air out the ball (yeah), just so I can flex. Take the air out the mall (hey, walk in with the sacks). Take the air out your broad (woo, woo, woo, E!). . The coupe came imported (hey). This season's Off White come in snorted (white). . Green Lamborghini accordance (Lambo). No human being, I'm immortal (no). Patek and A.P. full of water (Patek). Hundred K I spend on my señora (racks). My pinky on margarine, butter (margarine). And my ears got McDonald's nuggets (ayy). Soon as I land on the Leer (whew). Pigets, they wet, tears ('gets). 488, hit the gears (488). Suicide doors, Britney Spears. I'm boujee, so bitch, don't get near (boujee). Criss Angel, make dope disappear (voila). Hit the gas, it got flames out the rears (skrrt). It's a race to the bag, get the mills (hey). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144866760, "title": "Stir Fry", "artist": "Migos", "lyrics": "Whoo, whoo, whoo, whoo. Whoo, whoo, whoo, whoo. . Dance with my dogs in the night time (wroof). Trap niggas with the chickens like Popeyes (Popeyes). Money changing colors like tie-dye (tie-dye). I am just tryna get it, I ain't trynna die (no). She got a big ol onion booty, make the world cry (cry). In the kitchen, wrist twisted like its stir-fry (whip it). Hold them bands down (hey). Hold your mans down (hey). Who told you come around? (who?). This that trap sound (sound). Designer clothes, fashion shows. Trap house, made of gold. Control the bag now (control it). No need to brag now. And put the mask down (mask). We living fast now (fast). Finest hoes, wrist froze. . We can go, coast to coast. . Keep watchin' me whip up, still be real in fame. Dance with my dogs in the night time, yeah (woo, woo, woo, woo, wroof). In the kitchen, wrist twisted like its stir-fry (whip it). In the kitchen, wrist twisted like its stir-fry (whip it). . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 142016874, "title": "Greatest Love Story", "artist": "LANCO", "lyrics": "They said I was nothing but a troublemaker. Never up to no good. You were the perfect all American girl. Wouldn't touch me even if you could. But you was sneaking out your window every night. Riding shotgun in my car. We go to the river and find us a spot. And probably went a little too far. Just a little too far. . Cause I was gonna be your forever. You were gonna be my wife. We didn't know any better. Didn't have a clue about life. . But I was what you wanted. you were what I needed. And we could meet in between. We were gonna be the greatest love story. This town had ever seen. . So you went off to college and I got a job. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 145302671, "title": "Singles You Up", "artist": "Jordan Davis", "lyrics": "I ain't heard you laugh like that in a long time. I wonder if you stopped his world like you did mine just now. I see you sippin' white wine instead of whiskey. And does he want you to be just a little more city?. Well, I'm sorry if I'm oversteppin' boundaries. I don't mean to be, but I've just got to tell you how I feel. . If he ever singles you up, if he's ever stupid enough. I'm a be the first one callin' you baby (baby). If he ain't holdin' you tight, if he ain't treatin' you right. I'm a be the first one callin' him crazy (crazy). 'Cause girl, it's just a matter of time until you find. . That the right guy's starin' you back into your eyes, right now. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 139537332, "title": "What Lovers Do", "artist": "Maroon 5 feat. SZA", "lyrics": "Say say say, hey hey now baby. Oh mama, don't play now baby. Say say say, hey hey now baby. Said let's get one thing straight now baby. . Tell me, tell me if you love me or. not, love me or not, love me or not?. I'll bet the house on you,. am I lucky or not, lucky or not, lucky or not?. You gotta tell me if you love me or. not, love me or not, love me or not?. Been wishin' for you, am I lucky or not, lucky or not, lucky or not?. . Ooh, ooh ooh ooh been wishin' for you. Ooh, ooh tryna do what lovers do ooh. . Ooh, ooh ooh ooh been wishin' for you. Ooh, ooh tryna do what lovers do ooh. . Say say say, hey hey now baby. You gonna make me hit you with that lay down, baby (oh). Ooh say say say, hey hey now baby. You know what I need, out the gate now baby (oh, ohh). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 115475977, "title": "What Ifs", "artist": "Kane Brown feat. Lauren Alaina", "lyrics": "You say what if I hurt you. What if I leave you. What if I find somebody else. And I don't need you. What if this goes south. What if I mess you up. You say what if I break out. In two then what. Well I hear you girl. I feel you girl but not so fast. Before you make your mind up. I gotta ask. . What if I was made for you. And you were made for me. What if this is it. What if it's meant to be. What if I ain't one of them. Fools just Playin' some game. What if I just pulled you close. What if I leaned in. And the stars line up. And it's our last first kiss. What if one of these days baby. I'd go and change your name. What if. I loved all these what ifs away. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 139200979, "title": "Rewrite the Stars", "artist": "Zac Efron feat. Zendaya", "lyrics": "You know I want you. It's not a secret I try to hide. I know you want me. So don't keep saying our hands are tied. You claim it's not in the cards. But fate is pulling you miles away. And out of reach from me. But you're here in my heart. So who can stop me if I decide. That you're my destiny?. . What if we rewrite the stars?. Say you were made to be mine. Nothing could keep us apart. You'd be the one I was meant to find. It's up to you, and it's up to me. No one can say what we get to be. So why don't we rewrite the stars?. Maybe the world could be ours. . Tonight. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 134281514, "title": "Sorry Not Sorry", "artist": "Demi Lovato", "lyrics": "Payback is a bad bitch. And baby, I'm the baddest, I'm the baddest, I'm the baddest. Go. . Now I'm out here looking like revenge. Feelin' like a ten, the best I've ever been. And yeah, I know how bad it must hurt to see me like this. But it gets worse (wait a minute). Now you're out here looking like regret. Ain't too proud to beg, second chance you'll never get. And yeah, I know how bad it must hurt to see me like this. But it gets worse (wait a minute). . Now payback is a bad bitch. And baby, I'm the baddest. You fuckin' with a savage. Can't have this, can't have this (ah). And it'd be nice of me to take it easy on ya, but nah. . Baby, I'm sorry (I'm not sorry). Baby, I'm sorry (I'm not sorry). Being so bad got me feelin' so good. Showing you up like I knew that I would. Baby, I'm sorry (I'm not sorry). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 143917745, "title": "I just need U.", "artist": "tobyMac", "lyrics": "Last night put the heavy on me. Woke up and I'm feeling lonely. This world gotta a way of showing me (showing me). Some days it'll lift you up. Some days it'll call you bluff. Man, most of my days I ain't got enough. . And all I know. Is You're my only hope. . When I'm up when I'm down (uh, huh). When the wolves come around (tell me). When my feet hit the ground. I just need, I just need You. On my darkest days (uh, huh). When I'm losing faith (tell me). No, it ain't gon' change. I just need, I just need You. Lord, I need You. Yeah, I just need You. . Yeah, though I walk through the valley of the shadow of death. I will fear no evil, for Thou art with me. Thy rod and thy staff. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 143930786, "title": "Man of the Woods", "artist": "Justin Timberlake", "lyrics": "I brag about you to anyone outside. But I'm a man of the woods, it's my pride. I'm sorry baby, you know I try. But I'm a man of the woods, it's my pride. . Hey, sugar plum, look at where we are. So tonight, if I take it too far, that's okay because you know. I hear the making up's fun. Been a minute since we've had some time to breathe. So if you see another side of me that's okay because you know. I hear the making up's fun. . But then your hands talking, fingers walking, down your legs. Hey, there's the faucet. Someone's knocking like they know. But baby, don't you stop it, yes I'm watching. Your hand slides down the light. And girl you know. . I brag about you to anyone outside. But I'm a man of the woods, it's my pride. I'm sorry baby, you know I try. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 128721317, "title": "Despacito (Remix)", "artist": "Luis Fonsi feat. Daddy Yankee & Justin Bieber", "lyrics": "Comin' over in my direction. So thankful for that, it's such a blessin', yeah. Turn every situation into heaven, yeah. . Oh-oh, you are my sunrise on the darkest day. Got me feelin' some kind of way. Make me wanna savor every moment slowly, slowly. . You fit me tailor-made, love how you put it on. Got the only key, know how to turn it on. The way you nibble on my ear, the only words I wanna hear. Baby, take it slow so we can last long (oh). . Tú, tú eres el imán y yo soy el metal. Me voy acercando y voy armando el plan. Sólo con pensarlo se acelera el pulso (oh, yeah). . Ya, ya me estás gustando más de lo normal. Todos mis sentidos van pidiendo más. Esto hay que tomarlo sin ningún apuro. . Despacito. Quiero respirar tu cuello despacito. Deja que te diga cosas al oído. Para que te acuerdes si no estás conmigo. . Despacito. Quiero desnudarte a besos despacito. Firmar las paredes de tu laberinto. Y hacer de tu cuerpo todo un manuscrito (sube, sube, sube). Sube, sube (oh). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144205773, "title": "Maybe I'm Amazed (Bonus Track)", "artist": "Jamie Dornan", "lyrics": "Baby, I'm amazed at the way you love me all the time. Maybe I'm afraid of the way I love you. Baby, I'm amazed at the the way you pulled me out of time. You hung me on a line. Maybe I'm amazed at the way I really need you. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 139200972, "title": "The Greatest Show", "artist": "Hugh Jackman feat. Keala Settle, Zac Efron, Zendaya & The Greatest Showman Ensemble", "lyrics": "Woah. Woah. Woah. Woah. Woah. Woah. Woah. Woah. Woah. . Ladies and gents, this is the moment you've waited for (woah). Been searching in the dark,. your sweat soaking through the floor (woah). And buried in your bones there's an ache that you can't ignore. Taking your breath, stealing your mind. And all that was real is left behind. . Don't fight it, it's coming for you, running at ya. It's only this moment, don't care what comes after. Your fever dream, can't you see it getting closer. Just surrender 'cause you feel the feeling taking over. It's fire, it's freedom, it's flooding open. It's a preacher in the pulpit and you'll find devotion. There's something breaking at the brick of every wall. it's holding I'll let you now, so tell me do you wanna go?. . Where it's covered in all the colored lights. Where the runaways are running the night. Impossible comes true, it's taking over you. Oh, this is the greatest show. We light it up, we won't come down. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 115144742, "title": "That's What I Like", "artist": "Bruno Mars", "lyrics": "I got a condo in Manhattan. Baby girl, what's hatnin'?. You and your ass invited. So gon' and get to clappin'. So pop it for a pimp. Pop, pop it for me. Turn around and drop it for a pimp. Drop, drop it for me. I'll rent a beach house in Miami. Wake up with no jammies. Lobster tail for dinner. Julio serve that scampi. You got it if you want it. Got, got it if you want it. Said you got it if you want it. Take my wallet if you want it now. . Jump in the Cadillac. Girl, let's put some miles on it. Anything you want. Just to put a smile on it. You deserve it baby, you deserve it all. And I'm gonna give it to you. . Gold jewelry shining so bright. Strawberry champagne on ice. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 126372373, "title": "Something Just Like This", "artist": "The Chainsmokers feat. Coldplay", "lyrics": "I've been reading books of old. The legends, and the myths. Achilles, and his gold. Hercules, and his gifts. Spiderman's control. And Batman with his fists. And clearly I don't see myself upon that list. . She said, where'd you wanna go?. How much you wanna risk?. I'm not looking for somebody. With some superhuman gifts. Some superhero. Some fairytale bliss. Just something I can turn to. Somebody I can kiss. . I want something just like this. Doo-doo-doo, doo-doo-doo. Doo-doo-doo, doo-doo. Doo-doo-doo, doo-doo-doo. Oh, I want something just like this. Doo-doo-doo, doo-doo-doo. Doo-doo-doo, doo-doo. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 129988354, "title": "I Like Me Better", "artist": "Lauv", "lyrics": "To be young and in love in New York City. Do not know who I am but still know I'm good as long as you're here with me. To be drunk and in love in New York City. Midnight into morning coffee. Burning through the hours talking. . Damn. . I like me better when I'm with you. I like me better when I'm with you. I knew from the first time, I'd stay for a long time. 'Cause I like me better when. I like me better when I'm with you. . I don't know what it is but I got that feeling. Waking up in this bed next to you, swear the room yeah. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 145555988, "title": "Wild Love", "artist": "James Bay", "lyrics": "Don't know what to say to you now. Standing right infront of you. Don't know how to fade in and out. Don't know how to play it cool. Lose a little guard, let it down. We don't have to think it through. We've got to let go. . I wanna give you wild love. The kind that never slows down. I wanna take you high up. Let our hearts be the only sound. I wanna go where the lights burn low and you're only mine. I wanna give you wild love. . Tried to call you. To feel you close. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 129639289, "title": "The Long Way", "artist": "Brett Eldredge", "lyrics": "Don't think I've ever seen your kind of pretty. Wanderin' around this midnight mad house city. You got a look that says you got it all together. So if you don't mind I'd like to know you better. . Take me the long way around your town. Were you the queen with the silver crown. I want the secrets you keep, the shine underneath. Of the diamond I think I just found. Take me the long way around. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 125640992, "title": "Body Like a Back Road", "artist": "Sam Hunt", "lyrics": "Got a girl from the Southside. Got braids in her hair. First time I seen her walk by. Man I ‘Bout fell up out my chair. . Had to get her number. Took me like 6 weeks. Now me and her go way back. Like Cadillac seats. . Body like a back road. Could drive it with my eyes closed. I know every curve like the back of my hand. Doin' fifteen in a thirty. I ain't in no hurry. I'm a take it slow just as fast as I can. . The way she fit in them blue jeans. She don't need no belt. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 139200977, "title": "Never Enough", "artist": "Loren Allred", "lyrics": "I'm trying to hold my breath. Let it stay this way. Can't let this moment end. You set off a dream with me. Getting louder now. Can you hear it echoing?. Take my hand. Will you share this with me?. 'Cause darling without you. . All the shine of a thousand spotlights. All the stars we steal from the nightsky. Will never be enough. Never be enough. Towers of gold are still too little. These hands could hold the world but it'll. Never be enough. Never be enough. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144138357, "title": "Tequila", "artist": "Dan + Shay", "lyrics": "I can still shut down a party. I can hang with anybody. I can drink whiskey and red wine. Champagne all night. Little Scotch on the rocks and I'm fine, I'm fine. . But when I taste tequila, baby I still see ya. Cutting up the floor in a sorority t-shirt. The same one you wore when we were. Sky high in Colorado, your lips pressed against the bottle. Swearing on a Bible, baby, I'd never leave ya. I remember how bad I need ya, when I taste tequila. When I taste tequila. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 139825251, "title": "Female", "artist": "Keith Urban", "lyrics": "When you hear somebody say somebody hits like a girl. How does that hit you?. Is that such a bad thing?. When you hear a song that they play saying you run the world. Do you believe it?. Will you live to see it?. . Sister, shoulder, daughter lover, healer, broken halo,. mother nature, fire, suit of armor, soul survivor, holy water. Secret keeper, fortune teller, virgin Mary,. scarlet letter, technicolor, river wild, baby girl, woman, child. Female. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 137964231, "title": "The Rest of Our Life", "artist": "Tim McGraw feat. Faith Hill", "lyrics": "Sittin' with you in a dark room. Warm by a fireplace. You know there's just something about you. You brighten my day uum uum. . I got something to run past you. I just hope I say it right. So I take your hand and ask you. Have you made plans for the rest of your life?. There's one thing I should be givin\" up, givin' up now. . And that's worryin' about life. Oh, I'll be fine. If one gray hair shows, i'll be fine. If my waistline goes, i'll be fine. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 145563476, "title": "Love You Better", "artist": "King Combs feat. Chris Brown", "lyrics": "I made it like that. I bought it like that. I'm living like that. . Tell me how to make things right. 'Cause I just need you in my life. Girl, I love you better than yourself. Better than you love yourself. I just need your lovin' baby. . Who gon' love you like I do, that's word (oh). All the times you confused, my words you don't listen (oh). You could've had Christian and Christian Dior (yeah). Now you just miss and I'm missing you more (oh). But you knew that I'm the cool cab with the roof back (yeah). Know I need you by my side, can't lose that (oh). But you still wanna test the waters. Like I never showed you jets and boarders on the coast of Florida (yeah). So why you wanna act like that ? (woo). Like the nigga never had your back. His or hers to match. What's wrong, girl ? Pick up the phone. Sayin' \"you're not home, nigga leave me alone\" (woo). But fuck it then, that's my word I'll never love again. Same time wanting you back, I'm a sucker then (oh baby). Coulda gave you my last name, you want some other shit. All 'cause your thought I was laid up with some other chick. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 145344334, "title": "T'd Up", "artist": "Rae Sremmurd", "lyrics": "EarDrummers. Chopsquad. Metro Boomin want some more, nigga. Yeah, yeah, yeah, hey. . I'm T'd up (damn, ayy). I didn't see no speedbump (stop playin', yo, ayy). I T'd off (hit it, yeah). Dropped the top and screeched off (skrrt, hey). They-they ticked off (they mad, ticked off). They ticked off (my bad, woo). We T'd up (T'd up, no). I T'd up (woo, woo). . I'm so fresh I need a fuckin' lint brush. I don't want the truck if it ain't lifted up. Drink so fast, I just done got the hiccups (hic, hic, hic). Took her shoppin', she think I'm the shoe plug. Come back from the dead, I feel like Frankenstein. Five chains on my neck and they got hangtime (yeah, yeah). Niggas rap, but they don't even stay around. Rollin' weed and baby, yes, I hang glide. Bring in them hundreds, end of discussion (crush it). Bad chick blushin', turbo bustin' (giddy up, giddy up). . I'm T'd up (damn). I didn't see no speedbump (stop playin', yo, ayy). I T'd off (hit it, yeah). Dropped the top and screeched off (skrrt, hey). They-they ticked off (they mad, ticked off). They ticked off (my bad, woo). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 72326117, "title": "Thinking Out Loud", "artist": "Ed Sheeran", "lyrics": "When your legs don't work like they used to before. And I can't sweep you off of your feet. Will your mouth still remember the taste of my love?. Will your eyes still smile from your cheeks?. . And, darling, I will be loving you till we're 70. And, baby, my heart could still fall as hard at 23. And I'm thinking 'bout how people fall in love in mysterious ways. Maybe just the touch of a hand. Well, me, I fall in love with you every single day. And I just wanna tell you I am. . So, honey, now. Take me into your loving arms. Kiss me under the light of a thousand stars. Place your head on my beating heart. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 78303197, "title": "Love Me Like You Do", "artist": "Ellie Goulding", "lyrics": "You're the light, you're the night. You're the color of my blood. You're the cure, you're the pain. You're the only thing I wanna touch. Never knew that it could mean so much, so much. . You're the fear, I don't care. 'Cause I've never been so high. Follow me through the dark. Let me take you past our satellites. You can see the world you brought to life, to life. . So love me like you do, lo-lo-love me like you do. Love me like you do, lo-lo-love me like you do. Touch me like you do, to-to-touch me like you do. What are you waiting for?. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 33233673, "title": "Dreams and Nightmares", "artist": "Meek Mill", "lyrics": "Ain't this what they've been waiting for?. You ready?. . I used to pray for times like this, to rhyme like this. So I had to grind like that to shine like this. In a matter of time I spent on some locked up shit. In the back of the paddy wagon, cuffs locked on wrists. See my dreams unfold, nightmares come true. It was time to marry the game and I said, \"Yeah, I do\". If you want it you gotta see it with a clear-eyed view. Got a shorty, she try'na bless me like I said, \"Achoo\". Like a nigga sneezed. nigga please before them triggers squeeze. I'm gettin' cream, never let them hoes get in between. Of what we started, lil' nigga but I'm lionhearted. They love me when I was stuck and hated when I was departed. I go and get it regardless, draw it like I'm an artist. No crawling, went straight to walkin' with foreign cars in my garage. Got foreign bitches menaging, fuckin', suckin', and swallowin'. Anything for a dollar, they tell me get 'em, I got 'em. I did it without an album. I did shit with Mariah. Lil' nigga I'm on fire. Icy as a hockey rink, Philly nigga I'm Flyer. When I bought the Rolls Royce they thought it was leased. Then I bought that new Ferrari, hater rest in peace. Hater rest in peace, rest in peace to the parking lot. Phantom so big, it can't even fit in the parking spot. You ain't talkin' bout my niggas then what you talkin' bout?. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 125075275, "title": "Like I Loved You", "artist": "Brett Young", "lyrics": "Would've thought you wrote down every word. Goodbye spelled out like it had been rehearsed. There ain't no point in tryin' to change your mind. Seems like you've got it all figured out. You're alright. . With the way this is goin' down. Don't tell me we can still be friends. Hangin' on the weekend. You're gonna be okay if I start seein' somebody new. You hope that I do. It won't be alone. . Till I forget to call every time that I'm drinkin'. And you ain't the love song. I can't keep from singin'. I gotta be honest. You really believe that's the truth. You never loved me like I loved you. . By the way you're talkin: you would think. You never had any real feelings for me. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 77429799, "title": "Uptown Funk", "artist": "Mark Ronson Feat. Bruno Mars", "lyrics": "Doh. Doh doh doh, doh doh doh. Doh doh. Doh doh doh, doh doh doh. Doh doh. Doh doh doh, doh doh doh. Doh doh. Aaaaaow!. . This shit, that ice cold. Michelle Pfeiffer, that white gold. This one, for them hood girls. Them good girls, straight masterpieces. . Stylin', while in. Livin' it up in the city. Got Chucks on with Saint Laurent. Gotta kiss myself, I'm so pretty. . I'm too hot (hot damn). Called a police and a fireman. I'm too hot (hot damn). Make a dragon wanna retire, man. . I'm too hot (hot damn). Say my name, you know who I am. I'm too hot (hot damn). Am I bad 'bout that money?. Break it down. . Girls hit your hallelujah (wooh). Girls hit your hallelujah (wooh). Girls hit your hallelujah (wooh). 'Cause Uptown Funk gon' give it to you (wooh). . 'Cause Uptown Funk gon' give it to you. 'Cause Uptown Funk gon' give it to you. Saturday night, and we in the spot. Don't believe me, just watch, come on!. . Don't believe me, just watch. Don't believe me, just watch. Don't believe me, just watch. Don't believe me, just watch. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 133547046, "title": "Legends", "artist": "Kelsea Ballerini", "lyrics": "We were golden, we were fire, we were magic. Yeah and they all knew our names all over town. We had it made in the middle of the madness. We were neon in a gray cloud. . Yeah, we wrote our own story. Full of blood sweat and heartbeats. We didn't do it for the fame or the glory. But we went down in history. . Yeah we were legends. Loving you baby it was Heaven. What everyone wondered we'd never question. Close our eyes and took on the world together. Do you remember?. We were crazy. Tragic and epic and so amazing. I'll always wear the crown that you gave me. We will always stay lost in forever. And they'll remember. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 133527700, "title": "Silence", "artist": "Marshmello & Khalid", "lyrics": "Yeah, I'd rather be a lover than a fighter. 'Cause all my life, I've been fighting. Never felt a feeling of comfort. All this time, I've been hiding. . And I never had someone to call my own, oh nah. I'm so used to sharing. Love only left me alone. But I'm at one with the silence. . I've found peace in your violence. Can't show me there's no point in trying. I'm at one, and I've been quiet for too long, oh. . I've found peace in your violence. Can't show me there's no point in trying. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 137955067, "title": "Attention", "artist": "Charlie Puth", "lyrics": "You've been running 'round, running 'round, running 'round. Throwing that dirt all on my name. 'Cause you knew that I, knew that I, knew that I'd call you up. You've been going 'round, going 'round, going 'round. Every party in LA. 'Cause you knew that I, knew that I, knew that I'd be at one. . I know that dress is karma, perfume regret. You got me thinking about when you were mine, ooh. And now I'm all up on you, what'd you expect?. But you're not coming home with me tonight. . You just want attention, you don't want my heart. Maybe you just hate the thought of me with someone new. Yeah, you just want attention, I knew from the start. You're just making sure I'm never getting over you. . You've been running 'round, running 'round, running 'round. Throwing that dirt all on my name. 'Cause you knew that I, knew that I, knew that I'd call you up. Baby, now that we're, now that we're, now that we're. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 84367682, "title": "Guts Over Fear", "artist": "Eminem feat. Sia", "lyrics": "Feels like a close, it's coming to. Fuck am I gonna do?. It's too late to start over. This is the only thing I, thing I know. . Sometimes I feel like all I ever do is. Find different ways to word the same, old song. Ever since I came along. From the day the song called ‘'Hi! My Name Is\" dropped. Started thinking my name was fault. Cause anytime things went wrong. I was the one who they would blame it on. The media made me the, uh, equivalent of a modern-day Genghis Khan. Tried to argue it was only entertainment, dawg. Gangsta? Naw, courageous balls. Had to change my style, they said I'm way too soft. And I sound like AZ and Nas, out came the claws. And the fangs been out since then. But up until the instant that I've went against it. It was ingrained in me that I wouldn't amount to a shitstain I thought. No wonder I had to unlearn everything my brain was taught. Do I really belong in this game? I pondered. I just wanna play my part, should I make waves or not?. So back and forth in my brain the tug of war wages on. And I don't wanna seem ungrateful or disrespect the artform I was raised upon. But sometimes you gotta take a loss. And have people rub it in your face before you get made pissed off. And keep pluggin', it's your only outlet. And your only outfit so you know they gonna talk about it. Better find a way to counter it quick and make it, ah. Feel like I've already said this a kabillion eighty times. How many times can I say the same thing different ways that rhyme?. What I really wanna say is, if there's anyone else that can relate to my story. Bet you feel the same way I felt when I was in the same place you are. When I was afraid to…. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 145579337, "title": "PROUD", "artist": "2 Chainz feat. YG & Offset", "lyrics": "Yeah, do it for the hood, nigga, rep. Yeah, Soufside with an F 'cause I'm fresh. Do it for the hood, nigga, rep. Soufside with an F 'cause I'm fresh. Tryna make my mama proud, uh. I ain't tryna let my mama down (yah). I'm just tryna make my mama proud, uh. I ain't fuckin' 'round with you (uh, uh, uh). . T.R.U. University, I pull it up and murk a beat. Mama house was filled up with bags of Hercules (strong). Soon as I finished pissin', I put the seat down. Or my mama'd be cussin' my damn ass out. Only child, no siblings, no besties. I couldn't do nothin' right like a lefty (woo). Bought my mama's first house with the juug money (alright). Bought my mama's second house with the club money (show). Me and mama used to trap out the same house (same house). Used to eat and go to sleep on the same couch (same couch). Me and mama got busted at the same time (same time). Went to court and told judge the damn same lies (same lies). I can tell mama proud of her only son. 2 Chainz, I have always worn more than one. Yeah I'm real, I'm ill, you know, you gotta feel. You poppin' pills, I'm rarer than two dollar bills. . Yeah, I'm just tryna make my mama proud (make my mama proud, yeah). I ain't tryna let my mama down (down, down, down). Yeah, I'm just tryna make my mama proud, yeah (proud, yeah). I ain't tryna let my mama down (down, down, down). Yeah, mama ain't raise no hoe, one more time. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 139200973, "title": "A Million Dreams", "artist": "Ziv Zaifman feat. Hugh Jackman & Michelle Williams", "lyrics": "I close my eyes and I can see. The world that's waiting up for me. That I call my own. Through the dark, through the door. Through where no one's been before. But it feels like home. . They can say, they can say it all sounds crazy. They can say, they can say I've lost my mind. I don't care, I don't care, so call me crazy. We can live in a world that we design. . 'Cause every night I lie in bed. The brightest colors fill my head. A million dreams are keeping me awake. I think of what the world could be. A vision of the one I see. A million dreams is all it's gonna take. A million dreams for the world we're gonna make. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144369440, "title": "Woman, Amen", "artist": "Dierks Bentley", "lyrics": "I'd lose my way, yeah, I'd lose my mind. If I faced one day on my own. I know I was saved, the night that she gave. This drifter's heart a home.. . Every night I should be on my knees. Lord knows how lucky I am. I'll never say it near enough. Thank God, for this woman, amen.. . This world has a way of shaking your faith. I've been broken again and again. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 128520454, "title": "HUMBLE.", "artist": "Kendrick Lamar", "lyrics": "Nobody pray for me, . It been that day for me. Waaaaay (yeah, yeah!). . . Ayy, I remember syrup sandwiches and crime allowances. Finesse a nigga with some counterfeits. But now I'm countin' this. Parmesan where my accountant lives. In fact, I'm downin' this. D'USSÉ with my boo bae, tastes like Kool-Aid for the analysts. Girl, I can buy yo' ass the world with my paystub. Ooh, that pussy good, won't you sit it on my taste bloods?. I get way too petty once you let me do the extras. Pull up on your block, then break it down: we playin' Tetris. A.M. to the P.M., P.M. to the A.M., funk. Piss out your per diem, you just gotta hate 'em, funk. If I quit your BM, I still ride Mercedes, funk. If I quit this season, I still be the greatest, funk. My left stroke just went viral. Right stroke put lil' baby in a spiral. Soprano C, we like to keep it on a high note. It's levels to it, you and I know, bitch, be humble. . . (Hol' up, bitch) sit down. (Hol' up lil' bitch, hol' up lil' bitch) be humble. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 134281595, "title": "Glorious", "artist": "Macklemore feat. Skylar Grey", "lyrics": "You know I'm back like I never left. Another sprint, another step. Another day, another breath. Been chasing dreams, but I never slept. I got a new attitude and a lease on life. And some peace of mind. Seek and I find I can sleep when I die. Wanna piece of the pie, grab the keys to the ride. And shit I'm straight. I'm on my wave, I'm on my wave. Get out my wake, I'm running late, what can I say?. I heard you die twice, once when they bury you in the grave. And the second time is the last time that somebody mentions your name. So when I leave here on this earth, did I take more than I gave?. Did I look out for the people or did I do it all for fame?. Legend it's exodus searching for euphoria. Trudging through the mud to find the present, no ignoring us. Got 20, 000 deep off in the street like we some warriors. My mama told me never bow your head, woo!. . I feel glorious, glorious. Got a chance to start again. I was born for this, born for this. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 139264077, "title": "Ric Flair Drip", "artist": "Offset feat. Metro Boomin", "lyrics": "Bijan 4 The 1 Time. Metro Boomin' want some more, nigga!. . Going to the jeweler, bust the AP, yeah. Slide on the water like a jet-ski, yeah. I'm tryna fuck you and your bestie, yeah. Chopper with the scope so do not test me, yeah. Ric Flair drip go \"woo\" on a bitch. Fifty-seven ninety split the coupe on my wrist. Multi-million dollar, I'm a fool with the hits. Hop up in the Lamb, and drop the roof, show the tits. . Poppin' but you really not 'gone shoot. Ninety pointers [?] my diamonds look like hula hoops. Hopping in my Bentaya, take her Hennessy to masseuse. Balenciaga, Valentino boots. It's the Boominati way, a lotta Lambs, a lotta Wraiths. Never hesitate to give a nigga yellow tape. And worry 'bout the bag 'cause the cash accumulate. Soon as we came in the game, all these niggas they imitate. Put my mind on it then I put my grind on it. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 128954469, "title": "When It Rains It Pours", "artist": "Luke Combs", "lyrics": "Sunday morning, man,. she woke up fighting mad. Bitching and moaning on and on 'bout the time I had. And by Tuesday, you could say that girl was good as gone. Then when Thursday came around,. I was all alone. . So I went for a drive to clear my mind,. ended up at a Shell on I-65. . Then I won a hundred bucks on a scratch off ticket. Bought two twelve packs and a tank of gas with it. She swore they were a waist of time,. oh, but she was wrong. I was caller number 5 on a radio station,. won a 4-day, 3-night, beach vacation. Deep sea, senorita,. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 134231831, "title": "Walk on Water", "artist": "Thirty Seconds to Mars", "lyrics": "(Do you believe?) Walk on water. . Can you even see what you're fighting for?. Bloodlust and a holy war. Listen up, hear the patriots shout:. \"Times are changing\". In the end, the choice was clear. Take a shot in the face of fear. Fist up in the fiery light. Times are changing. . Do you believe that you can walk on water?. Do you believe that you can win this fight tonight?. (Do you believe?). . Look at the sky, see a dying star. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 14672333, "title": "Rock Your Body", "artist": "Justin Timberlake", "lyrics": "Don't be so quick to, walk away. Dance with me. I wanna rock your body. Please stay. Dance with me. You don't have to admit you, wanna play. Dance with me. Just let me rock you. Till the break of day. Dance with me. . Got time, but I don't mind. Just wanna rock you girl. I'll have whatever you have. Come on, just give it a whirl. See I've been watchin' you. I like the way you move. So go ahead, girl, just do. That ass shakin' thing you do. . So you grab your girls. And you grab a couple more. And you all come meet me. In the middle of the floor. Said the air is thick, it's smellin' right. So you pass to the left and you sail to the right. . Don't be so quick to, walk away. Dance with me. I wanna rock your body. Please stay. Dance with me. You don't have to admit you, wanna play. Dance with me. Just let me rock you. Till the break of day. Dance with me. . I don't mean no harm. Just wanna rock you girl. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 83593858, "title": "The Sound of Silence", "artist": "Disturbed", "lyrics": "Hello darkness, my old friend. I've come to talk with you again. Because a vision softly creeping. Left its seeds while I was sleeping. And the vision that was planted in my brain. Still remains. Within the sound of silence. . In restless dreams I walked alone. Narrow streets of cobblestone. 'Neath the halo of a street lamp. I turned my collar to the cold and damp. When my eyes were stabbed by the flash of a neon light. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 17546365, "title": "Cupid Shuffle", "artist": "Cupid", "lyrics": "New Cupid, time for a change. Cupid shuffle, Cupid shuffle. Cupid shuffle, Cupid shuffle. (New style). . Down, down, do your dance, do your dance. (We got a brand new dance). Down, down, do your dance, do your dance. Down, down, do your dance, do your dance. Down, down, do your dance, do your dance. (New style, yeah). . They say I'm a rapper and I say no, come on. They say what you doing, tryna do some Zydeco. I just let the music come from my soul. So all of my people can stay on the floor. . They got a brand new dance, you gotta move your muscle. Brand new dance, it's called the Cupid shuffle. It don't matter if you're young or you're old, here we go. We gone show you how it go. . To the right, to the right, to the right, to the right. To the left, to the left, to the left, to the left. Now kick, now kick, now kick, now kick. Now walk it by yourself, now walk it by yourself. (Let me see you do). . Down, down, do your dance, do your dance. Down, down, do your dance, do your dance. (A let me see ya do the Cupid). Down, down, do your dance, do your dance. Down, down, do your dance, do your dance, come on. . Down, down, do your dance, do your dance. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 132673050, "title": "Rx (Medicate)", "artist": "Theory of a Deadman", "lyrics": "Wake up to a cloudy day. Dark rolls in and it starts to rain. Staring out to the cage-like walls. Time goes by and the shadows crawl. . Crushin' Candy Crush-ing pills. Got no job, mom pays my bills. Textin', Nexus, get my feels. Sweatin' bullets, Netflix-chills. . World's out there singin' the blues. Twenty more dead on the evening news. Think to myself: \"Really, what's the use?\". I'm just like you, I was born to lose. . Why, oh why can't you just fix me?. When all I want's to feel numb. But the medication's all gone. . Why, oh why does God hate me?. When all I want's to get high. And forget this so-called life. . I am so freakin' bored. Nothing to do today. I guess I'll sit around and medicate (I medicate). . I am so freakin' bored. Nothing to do today. I guess I'll sit around and medicate (I medicate). . Can't wait to feel better than I ever will. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 19649160, "title": "Mirrors", "artist": "Justin Timberlake", "lyrics": "Aren't you something to admire, 'cause your shine is something like a mirror. And I can't help but notice, you reflect in this heart of mine. If you ever feel alone and the glare makes me hard to find. Just know that I'm always parallel on the other side. 'Cause with your hand in my hand and a pocket full of soul. . I can tell you there's no place we couldn't go. Just put your hand on the glass, I'm here trying to pull you through. You just gotta be strong. 'Cause I don't wanna lose you now. . I'm looking right at the other half of me. The vacancy that sat in my heart. Is a space that now you hold. Show me how to fight for now. And I'll tell you, baby, it was easy. Coming back into you once I figured it out. You were right here all along. It's like you're my mirror. . My mirror staring back at me. I couldn't get any bigger. With anyone else beside of me. And now it's clear as this promise. That we're making two reflections into one. 'Cause it's like you're my mirror. My mirror staring back at me, staring back at me. Aren't you something, an original, 'cause it doesn't seem merely assembled. . And I can't help but stare 'cause I see truth somewhere in your eyes. Ooh I can't ever change without you, you reflect me, I love that about you. And if I could, I would look at us all the time. 'Cause with your hand in my hand and a pocket full of soul. I can tell you there's no place we couldn't go. . Just put your hand on the past, I'm here trying to pull you through. You just gotta be strong. 'Cause I don't wanna lose you now. I'm looking right at the other half of me. . The vacancy that sat in my heart. Is a space that now you hold. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 130985849, "title": "Sit Next to Me", "artist": "Foster the People", "lyrics": "Yeah, it's over, it's over. I'm circling these vultures. Got me praying that it's longer. Feeling something rotten. Last time I saw you said \"What's up?\". And pushed right through. Then I tried to catch you. But we're always on the move. And now it's over, we're sober. Symptoms of the clout-ture. And the night ain't getting younger. Last call's around the corner. Feeling kinda tempted. And I'm pouring out the truth. Just fading out this talk is 'cause now all I want is you. . I'm saying, come over here sit next to me. We can see where things go naturally. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 128770205, "title": "There's Nothing Holdin' Me Back", "artist": "Shawn Mendes", "lyrics": "I wanna follow where she goes. I think about her and she knows it. I wanna let her take control. Cause everytime that she gets close, yeah. . She pulls me in enough to keep me guessing (Hmm). And maybe I should stop and start confessing. Confessing, yeah. . Oh, I've been shaking. I love it when you go crazy. You take all my inhibitions. Baby, there's nothing holdin' me back. . You take me places that tear up my reputation. Manipulate my decisions. Baby, there's nothing holdin' me back. . There's nothing holdin' me back. There's nothing holdin' me back. . She says that she's never afraid. Just picture everybody naked. She really doesn't like to wait. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 115144746, "title": "Finesse", "artist": "Bruno Mars", "lyrics": "Ooh, don't we look good together?. There's a reason why they watch all night long. Yeah, know we'll turn heads forever. So tonight I'm gonna show you off. . When I'm walkin' with you. I watch the whole room change. Baby, that's what you do. No my baby don't play. Blame it on my confidence. Oh, blame it on your measurements. Shut that shit down on sight. That's right. . We out here drippin' in finesse. It don't make no sense. Out here drippin' in finesse. You know it, you know it. We out here drippin' in finesse. It don't make no sense. Out here drippin' in finesse. You know it, you know it. . Now slow it down for me baby. 'Cause I love the way it feels when we grind. Yeah, our connection's so magnetic on the floor. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 136765509, "title": "Losing Sleep", "artist": "Chris Young", "lyrics": "Light a candle. Turn all the lights down low. Baby, let's just lose control, lose control. I can handle every single curve, you know. That I love you, let me show you, oh. . Fall into me, let me breathe the air you breathe. I can take you anywhere you wanna be. When it comes to us every single touch is something special. When we're wrapped up in those sheets. Yeah, we're winning, we're losing. When we're losing sleep. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144205756, "title": "Sacrifice", "artist": "Black Atlass feat. Jessie Reyez", "lyrics": "I will never sacrifice my love, not even for you. You know I don't play it safe. Sometimes you have to break the rules. Yeah, we could call it love, or we could call it nothing. But you got what I want, so baby, give me something. Yeah, we could call it love, or we could call it nothing. But you got what I want, you know I do, too. . So let me, let me just lay you down. Turn me on, take it all tonight. Let me, let me just lay you down. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 133598565, "title": "Drunk Girl", "artist": "Chris Janson", "lyrics": "Couple cover charge stamps got her hand looking like a rainbow. In and out of every bar on a whim just like the wind blows. She's either a bachelorette or coming off a breakup. Take a drunk girl home. . She's bouncing like a pinball. Singing every word she never knew. Dancing with her eyes closed like she's the only one in the room. But here's a perfect mess, falling out of that dress. Take a drunk girl home. . Take a drunk girl home. Let her sleep all alone. Leave her keys on the counter your number by the phone. Pick up her life she threw on the floor. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 140765160, "title": "Échame la Culpa", "artist": "Luis Fonsi feat. Demi Lovato", "lyrics": "Hey, Fonsi. Oh, no. ¿Qué pasa Demi?. Hey, yeah. . Tengo en esta historia algo que confesar. Ya entendí muy bien que fue lo que pasó. Y aunque duela tanto tengo que aceptar. Que tú no eres la mala, que el malo soy yo. . No me conociste nunca de verdad. Ya se fue la magia que te enamoró. Y es que no quisiera estar en tu lugar. Porque tu error sólo fue conocerme. . No eres tú, no eres tú, no eres tú, soy yo (soy yo). No te quiero hacer sufrir, es mejor olvidar y dejarlo así (así). Échame la culpa. . No eres tú, no eres tú, no eres tú, soy yo (soy yo). No te quiero hacer sufrir, es mejor olvidar y dejarlo así (así). Échame la culpa. . Ok, I don't really, really wanna fight anymore. I don't really, really wanna fake it no more. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 140779894, "title": "Take Back Home Girl", "artist": "Chris Lane feat. Tori Kelly", "lyrics": "Duffle bag, backseat. My dash, your feet. Those other side of the highway headlights making you shine. My hand, your leg. Playlist playing. Even though I haven't made it yet. I'm dragging it, dropping it in my mind. . You're a drive real slow, down a no lane road. To a house on a hill where the wild things grow. You're wake up in pajamas, not a trace of makeup on ya. You're a help her fix it, having breakfast with my momma. You're a take back home, home, home girl. Home, home, home girl. Take back home, home, home girl. Home, home, home girl. . You're the kind I wanna take a ride with. Sit by on a Friday night. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 125075276, "title": "In Case You Didn't Know", "artist": "Brett Young", "lyrics": "I can't count the times. Almost said what's on my mind. But I didn't. Just the other day. . I wrote down all the things I'd say. But I couldn't. I just couldn't. Baby I know that you've been wonderin'. Mmm, so here goes nothin'. . In case you didn't know. Baby I'm crazy 'bout ya. And I would be lyin' if I said. That I could live this life without ya. Even though I don't tell you all the time. You had my heart a long long time ago. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144205761, "title": "The Wolf", "artist": "The Spencer Lee Band", "lyrics": "Just like the rain outside. Your body sweating, dripping' wet. And I just can't control myself, no, baby. Be my obsession. My possession. Baby, I got fine selection. This must be your lucky day, baby. . I wanna jack it, smack it. You know the shit that turns you on?. I wanna lick it, kiss it. I'll give you everything you want. . Howling out your name. Red like champagne. You're gonna feel the vibes. When the wolf comes out tonight. When the wolf comes out tonight. When the wolf comes out tonight. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 134319907, "title": "Look What You Made Me Do", "artist": "Taylor Swift", "lyrics": "I don't like your little games. Don't like your tilted stage. The role you made me play. Of the fool, no, I don't like you. . I don't like your perfect crime. How you laugh when you lie. You said the gun was mine. Isn't cool, no, I don't like you (oh!). . But I got smarter, I got harder in the nick of time. Honey, I rose up from the dead, I do it all the time. I've got a list of names and yours is in red, underlined. I check it once, then I check it twice, oh!. . Ooh, look what you made me do. Look what you made me do. Look what you just made me do. Look what you just made me. . Ooh, look what you made me do. Look what you made me do. Look what you just made me do. Look what you just made me do. . I don't like your kingdom keys. They once belonged to me. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 124981753, "title": "Despacito", "artist": "Luis Fonsi feat. Daddy Yankee", "lyrics": "Ay. Fonsi, DY. Oh, oh no, oh no (ey). Hey, yeah, diri-diri-diriridi, Daddy, go!. . Sí, sabes que ya llevo un rato mirándote. Tengo que bailar contigo hoy (DY). Vi que tu mirada ya estaba llamándome. Muéstrame el camino, que yo voy (oh). . Tú, tú eres el imán y yo soy el metal. Me voy acercando y voy armando el plan. Sólo con pensarlo se acelera el pulso (oh, yeah). . Ya, ya me estás gustando más de lo normal. Todos mis sentidos van pidiendo más. Esto hay que tomarlo sin ningún apuro. . Despacito. Quiero respirar tu cuello despacito. Deja que te diga cosas al oído. Para que te acuerdes si no estás conmigo. . Despacito. Quiero desnudarte a besos despacito. Firmar las paredes de tu laberinto. Y hacer de tu cuerpo todo un manuscrito (sube, sube, sube). Sube, sube (oh). . Quiero ver bailar tu pelo, quiero ser tu ritmo. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 134319902, "title": "...Ready For It?", "artist": "Taylor Swift", "lyrics": "Knew he was a killer. First time that I saw him. Wondered how many girls. He had loved and left haunted. But if he's a ghost, then. I can be a phantom. Holding him for ransom-som. Some boys are tryin' too hard. He don't try at all, though. Younger than my exes. But he act like such a man, so. I see nothing better. I keep him forever. Like a vendetta-ta. . I-I-I see how this is gon' go. Touch me and you'll never be alone. I-Island breeze and lights down low. No one has to know. . In the middle of the night. In my dreams. You should see the things we do. Baby, mmm. In the middle of the night. In my dreams. I know I'm gonna be with you. So I take my time. Are you ready for it?. . Knew I was a robber. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 141612306, "title": "MIC Drop (Steve Aoki Remix)", "artist": "BTS feat. Desiigner", "lyrics": "Git, git, brrra, git, git. Damn, son, where'd you get that from. Git, git, hey, brrra. Damn, hey, brrra. . Git, git (damn, bro). . Playin' that basketball, uh, we playin' that a lot, huh. I'ma just get to the chicken,. whip it, then I flip it, then trap it all, huh. I gotta get to the dolla. Fuck all them haters and back 'em off (git, git, brrra, back. Smokin' on gas a lot, ready to wack 'em all. Huh, huh, wack 'em all, wack 'em all. Clap, clap, clap, clap, clap 'em all, huh. This what I do to the haters,. the choppa hit 'em, tell 'em back 'em off, huh. She like Apple Jack, huh. I like apple sauce, huh, huh. That's a boss, huh, huh. That's the cost, huh, huh. Why you tryna flex and your fashion off?. Chain around my neck and her ass soft. . Smokin' on that gas, I ain't passin' off. Asthma cough, fashion law. Stash it off, dash it off. Flash it off, don't pass it off. I'ma just get to the chicken and trap hard, hard, hard with all my. . Did you see my bag? Did you see my bag?. It's hella trophies and it's hella thick. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 84494674, "title": "A Thousand Years", "artist": "Christina Perri", "lyrics": "Heart beats fast. Colors and promises. How to be brave?. How can I love when I'm afraid to fall?. But watching you stand alone. All of my doubt suddenly goes away somehow. One step closer. I have died every day waiting for you. Darling, don't be afraid. I have loved you. For a thousand years. I'll love you for a thousand more. Time stands still. . Beauty in all she is. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144476709, "title": "Parallel Line", "artist": "Keith Urban", "lyrics": "You said \"I love you\" to me. I don't know what that means. So froze my feet. People use it too carelessly. And I couldn't believe. That you would dive in so deep. And you said perfectly. Everything I've been feeling about you. It's time to break the chains that held me back from you. . So come on. Take a little bit of my. Heart tonight. No, I literally really don't mind. Just please don't misplace it. Take a little bit of my. Heart tonight. No, baby be mine now. Baby, be mine now. Maybe it's time we put our hearts in a parallel line. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 137537886, "title": "New Freezer", "artist": "Rich The Kid feat. Kendrick Lamar", "lyrics": "Ayy, new freezer. You know what it was when you signed up, ayy. Dat way, yuh, yuh, yeah dat way. . My bitch too foreign, need a visa (ooh). I don't need her (huh?). Pull up drop top with a eater (skrrt). Two seater (skrrt). New bitch wanna fuck to my AP (AP, ice). New freezer (ice). I woke up thinkin' 'bout bands (bands). Hop off a jet to a check when I land (yuh). My bitch too foreign, need a visa (bitch). I don't need her (huh?). Pull up drop top with a eater (yeah). Two seater (skrrt, skrrt). New bitch wanna fuck to my AP (bitch). New freezer (new freezer). I woke up thinkin' 'bout bands (new freezer). . Hop off a jet to a check when I land (dat way). . Ooh, money way (money). Diamonds, flexin' (bling, woo). I woke up rich, spend a grip on a necklace (yuh). I put the plug on three way (plug). Maserati go speed race (yeah). Drop a baby on a bitch face (woah). More ice flexin' this way (ice). We put the world on the wave (the wave). Don't give a fuck 'cause I'm paid (woo). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 124985075, "title": "Castle on the Hill", "artist": "Ed Sheeran", "lyrics": "When I was six years old, I broke my leg. I was running from my brother and his friends. And tasted the sweet perfume of the mountain grass I rolled down. I was younger then, take me back to when I. . Found my heart and broke it here. Made friends and lost them through the years. And I've not seen the roaring fields in so long. I know I've grown, but I can't wait to go home. . I'm on my way. Driving at 90 down those country lanes. Singing to Tiny Dancer. And I miss the way you make me feel, and it's real. When we watched the sunset over the castle on the hill. . Fifteen years old and smoking hand-rolled cigarettes. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 128482546, "title": "1-800-273-8255", "artist": "Logic feat. Alessia Cara & Khalid", "lyrics": "I've been on the low. I been taking my time. I feel like I'm out of my mind. It feel like my life ain't mine. Who can relate?. I've been on the low. I been taking my time. I feel like I'm out of my mind. It feel like my life ain't mine. . I don't wanna be alive. I don't wanna be alive. I just wanna die today. I just wanna die. I don't wanna be alive. I don't wanna be alive. I just wanna die. And let me tell you why. . All this other shit I'm talkin' 'bout they think they know it. I've been praying for somebody to save me, no one's heroic. And my life don't even matter, I know it, I know it. I know I'm hurting deep down but can't show it. I never had a place to call my own. I never had a home, ain't nobody callin' my phone. Where you been? Where you at? What's on your mind?. They say every life precious but nobody care about mine. . I've been on the low. I been taking my time. I feel like I'm out of my mind. It feel like my life ain't mine. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 136600152, "title": "Love So Soft", "artist": "Kelly Clarkson", "lyrics": "Hey. Every kiss is a door. Can I knock on yours? Can we knock a little more?. If your touch is a key. Keep on twisting, keep on locking, keep on turning me. . Let me in. I wanna be closer to you, let you under my skin. If I let you in. You gotta be careful with it. Let me tell you again (hey). . Love so soft, you ain't had nothing softer. Break it then you buy it and it sure gonna cost you. Love so soft that you can't rub off. You gon' love it if you try it. Got you hooked, now you're caught up. . Love so soft, so soft (so soft). Love so soft, so soft (so soft). . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 143930789, "title": "Supplies", "artist": "Justin Timberlake", "lyrics": "Ain't no need of stopping, girl. Yeah, there ain't no need of stopping, girl. Yeah, okay. . Met you out on Broadway on the hottest night in town. We arrived solo but we were being chased around. Saw you being cornered by some guy you used to know. Stepped in between the both of y'all. Said \"I'm leaving, do you wanna go?\". . 'Cause I'll be the light when you can't see. I'll be the wood when you need heat. I'll be the generator, turn me on when you need electricity. Some shit's 'bout to go down, I'll be the one with the level head. The world could end now, baby, we'll be living in The Walking Dead. . 'Cause I got supplie-ie-ies. Supplie-ie-ies. I got you, I got supplie-ie-ies. Supplie-ie-ies. . I don't know if you 'member this, but I was out of town. Flew in on a 3 AM just to show up and hear your sounds. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 116237770, "title": "Congratulations", "artist": "Post Malone feat. Quavo", "lyrics": "Mm-mmm. Yeah, yeah. Mm-mmm. Yeah. . My momma called, seen you on TV, son. Said shit done changed ever since we was on. I dreamed it all ever since I was young. They said I wouldn't be nothing. Now they always say congratulations. Worked so hard, forgot how to vacation. They ain't never had the dedication. People hatin', say we changed and look, we made it. Yeah, we made it. . They was never friendly, yeah. Now I'm jumping out the Bentley, yeah. And I know I sound dramatic, yeah. But I know I had to have it, yeah. For the money, I'm a savage, yeah. I be itching like a addict, yeah. I'm surrounded, twenty bad bitches, yeah. But they didn't know me last year, yeah. Everyone wanna act like they important. (Yeah, yeah, yeah, yeah, yeah, yeah). But all that mean nothing when I saw my dog. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 129999394, "title": "So Will I (100 Billion X)", "artist": "Hillsong UNITED", "lyrics": "God of creation. There at the start. Before the beginning of time. With no point of reference. You spoke to the dark. And fleshed out the wonder of light. . And as You speak. A hundred billion galaxies are born. In the vapour of Your breath the planets form. If the stars were made to worship so will I. I can see Your heart in everything You've made. Every burning star. A signal fire of grace. If creation sings Your praises so will I. . God of Your promise. You don't speak in vain. No syllable empty or void. For once You have spoken. All nature and science. Follow the sound of Your voice. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 140597600, "title": "Havana (Remix)", "artist": "Camila Cabello & Daddy Yankee", "lyrics": "Hey. . Havana, ooh na-na (ayy). Half of my heart is in Havana, ooh na-na (ayy, ayy). He took me back to East Atlanta, na-na-na. Oh, but my heart is in Havana (ayy). There's somethin' 'bout his manners (uh huh). Havana, ooh na-na (uh). . Él vino a buscarme y ahí lo supe (uh). Vi clara su actitud. Me dijo: \"son tantas las que yo tuve\" (uh). Pero me faltas tú. No puedo soltarte, no seas tan cruel (hey). Desde esa noche azul. Mi papá me dice que malo es él (uh). ¿Qué más puedo hacer?. . Ooh-ooh-ooh, lo supe en un segundo. Él cambiaría mi mundo. Ya no puedo más. Ooh-ooh-ooh, ay y es que me duele mucho. Decir adiós, oh na-na-na-na-na. . Havana, ooh na-na (ayy). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 139155338, "title": "I Miss You", "artist": "Clean Bandit feat. Julia Michaels", "lyrics": "I know you're out in Cabo. Hanging with your brother. Wishin' that I was your bottle. So I could be close to your lips again. . I know you didn't call your parents. And tell 'em that we ended. 'Cause you know that they'd be offended. Did you not want to tell 'em it's the end?. . And I know we're not supposed to talk. But I'm getting ahead of myself. I get scared when you're not. 'Cause I'm scared you're with somebody else. So, I guess that it's gone. And I just keep lying to myself. Oh, I can't believe it, I.... . I miss you, yeah, I miss you. I miss you, yeah, I miss you. Oh, I do. I miss you, yeah, I miss you. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144866757, "title": "Walk It Talk It", "artist": "Migos feat. Drake", "lyrics": "Yeah, yeah. Whoa, hold on (OG Parker). Uh. . . Walk it, like I talk it (walk it). Walk it, like I talk it. Walk it, walk it like I talk it (woo!). Walk it, like I talk it (yeah!). Walk it, like I talk it (walk it). Walk it, like I talk it. Walk it, walk it like I talk it (woo!). Walk it, like I talk it (hey!). Walk it, like I talk it (walk it). Walk it, like I talk it (walk it). Walk it, like I talk it. Walk it, walk it like I talk it (woo!). Walk it, like I talk it (talk it). Walk it, like I talk it (ayy!). Walk it, like I talk it. Walk it, walk it (woo). Like I talk it (yeah!). . Take my shoes and walk a mile. Something that you can't do (woo, hey!). Big talks of the town, big boy gang moves (gang moves!). I like to walk around with my chain loose (chain, chain!). She just bought a new ass but got the same boobs (same boobs!). Whipping up dope, scientist (whip it up, whip it up). (Cook it up, cook it up) (Skrrt-Skrrt!). That's my sauce, where you find it?. (That's my sauce) (Look it up, look it up, find it). Adding up checks, no minus. (Add it up, add it up, add it up, add it up, yeah). Get your \"respek\" in diamonds (ice, ice, ice, ice, ice, ice). I bought a 'Plain Jane' Rollie. These niggas bought they fame (woo!). I bet my back got scoliosis 'cause I swerve the lane (skrrt!). Heard you signed your life, for that brand new chain (I heard) Think it came with stripes, but you ain't straight with the gang (Gang, gang!).  . Walk it, like I talk it (walk it). Walk it, like I talk it. Walk it, walk it like I talk it (walk it). Walk it, like I talk it (woo!). Walk it, like I talk it (walk it). Walk it, like I talk it. Walk it, walk it like I talk it (talk it). Walk it, like I talk it (let's go). Walk it, like I talk it (walk it). Walk it, like I talk it (woop!). Walk it, like I talk it. Walk it, walk it like I talk it (hey!). Walk it, like I talk it (walk it). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 145577742, "title": "Black Panther", "artist": "Kendrick Lamar", "lyrics": "Wait. . King of my city, king of my country, king of my homeland. King of the filthy, king of the fallen, we living again. King of the shooters, looters, boosters, and ghettos poppin'. King of the past, present, future, my ancestors watchin'. King of the culture, king of the soldiers, king of the bloodshed. King of the wisdom, king of the ocean, king of the respect. King of the optimistics and dreamers that go and get it. King of the winners, district, and geniuses with conviction. King of the fighters, king of the fathers, king of the belated. King of the answer, king of the problem, king of the forsaken. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 125673809, "title": "Location", "artist": "Khalid", "lyrics": "Send me your location. Let's focus on communicating. 'Cause I just need the time and place. To come through (place to come through). Send me your location. Let's ride the vibrations. I don't need nothing else but you. (I don't need nothing else but you). . At times I wonder why I fool with you. But this is new to me, this is new to you. Initially, I didn't wanna fall for you. Gather my attention it was all for you, so don't. Take advantage, don't leave my heart damaged. To understand that things go a. Little bit better when you plan it... oh. . So won't you send me your location. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 85336464, "title": "SexyBack", "artist": "Justin Timberlake feat. Timbaland", "lyrics": "Ha. Uh. I'm bringing sexy back (yeah). Them other boys don't know how to act. (yeah). I think it's special what's behind your back. (yeah). So turn around and I'll pick up the slack. (yeah). (take 'em to the bridge) come on. Dirty babe (uh huh). You see these shackles baby I'm your slave. (uh huh). I'll let you whip me if I misbehave. (uh huh). It's just that no one makes me feel this way. (uh huh). (take 'em to the ) huh. (come here girl). Go 'head be gone with it. (come to the back). Go 'head be gone with it. (vip). Go 'head be gone with it. (drinks on me). Go 'head be gone with it. Let me see what you're twerkin' with. Go 'head be gone with it. (look at those hips). Go 'head be gone with it. (you make me smile). Go 'head be gone with it. (go 'head child). Go 'head be gone with it. (and get your sexy on) Yes. Go 'head be gone with it. (get your sexy on) Yes. Go 'head be gone with it. (get your sexy on) Yes. Go 'head be gone with it. (get your sexy on) Yes. Go 'head be gone with it. (get your sexy on) Yes (huh). Go 'head be gone with it. (get your sexy on) Yes. Go 'head, be gone with it. (get your sexy on) Yes. Go 'head be gone with it. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 134315854, "title": "Sky Walker", "artist": "Miguel feat. Travis Scott", "lyrics": "Quick to dead the bull like a matador. Quick to dead the bull like a matador. Bull, bull, bull like a matador. Quick to dead the bull like a matador. . Captain is still, catch a wave, roll us (splish). Take a shot, make a friend, just enjoy the moment. I'm Luke Skywalkin' on these haters (splish). Celebrate every day like a birthday. Good things come to those that wait up (splish). But don't wait to jump in too long. Don't sleep, you gotta stay up (splish). Don't, don't sleep, you gotta stay up. Yeah, yeah, yeah. . I'm outstandin' so I stand out (stand out). I'm more bathed than a bathhouse. Top Gun, on my Tom Cruise. I play for keeps and I don't lose. You're gonna love it 'cause you're cool as a breeze (cool as a breeze). So pick a poison, yeah, I got what you need (got what you need). Nonchalant, got the green on rotation. All night, we gon' keep it psychedelic like a.. . Captain is still, catch a wave, roll us (splish). Take a shot, make a friend, just enjoy the moment. I'm Luke Skywalkin' on these haters (splish). Celebrate every day like a birthday. Good things come to those that wait up (splish). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 145041514, "title": "El Farsante (Remix)", "artist": "Ozuna feat. Romeo Santos", "lyrics": "This is a Golden Remix. King. . Calculan que relaciones que fracasan mayormente es por desengaño. Falsedad que contamina y hace daño. Tú fuiste perfecto, clavel, que con mis manos marchité. Mi obra se llama \"Romeo Sin Julieta\" otra vez. . Puedes pensar, soy el rey de las mentiras, volvería a fallar. Aunque lo jure por mi vida, mis palabras no importan ni valen. Ni de rodilla na' eh na'. Dice que has visto muchas novelas, el actor debe llorar. . No, ¿ahora qué hago?. . Ozuna y yo somos farsantes, nos ahogamo' en el fracaso. No, no juro en vano,. jamás yo vuelvo a ser infiel con chapiadoras, yo te amo. No, escúchame esa pena que siento. Voy a hacer otro disco con Aventura y te lo dedico enterito. . Si todavía me amas como antes. Ya nada me parece interesante. Yo sé que en el amor soy un farsante. Yo sin ti no vuelvo a enamorarme, bebé. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 130803276, "title": "All Night", "artist": "Big Boi", "lyrics": "If it's all right. I wanna kick it with you all night, all night. Have a good time. Ain't gotta worry 'cause it's all right, it's all right. All night, and all night, and all night, baby. Don't be shy, don't be shy, don't be shy, baby. All night and all night. Ain't gotta worry 'cause it's all right, it's all right. . It's alright, it's okay. Everybody gonna say what they wanna say. Players gonna play when they wanna play. Long way, only for one night like Luther Vandross, right?. No way, Daddy Fat Saxxx don't skip no days. To eat her, meet her, greet her. Treat her like a queen then I give her that peter, jack. That's how we procreate. Take care my babies, I'mma cope the weight. I'mma carry the load, and I'mma win the bread, as well. No tricking off with my girl. Your chicken all on my girl. She thick with all of her curves. Plus she got a mind on her. Street smart, book smart, built by design for me. Gotta hold her up, 'cause she always holding me down. Like a bank robber with a note, give it to the teller, so she know we ain't fucking around. . It's something 'bout that company. I send for you if you come for me. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 123999037, "title": "Fear Is a Liar", "artist": "Zach Williams", "lyrics": "When he told you you're not good enough. When he told you you're not right. When he told you you're not strong enough. To put up a good fight. When he told you you're not worthy. When he told you you're not loved. When he told you you're not beautiful. That you'll never be enough. . Fear he is a liar. He will take your breath. Stop you in your steps. Fear he is a liar. He will rob your rest. Steal your happiness. Cast your fear in the fire. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 128520448, "title": "DNA.", "artist": "Kendrick Lamar", "lyrics": "I got, I got, I got, I got. Loyalty, got royalty inside my DNA. Cocaine quarter piece, got war and peace inside my DNA. I got power, poison, pain and joy inside my DNA. I got hustle though, ambition, flow, inside my DNA. I was born like this, since one like this. Immaculate conception. I transform like this, perform like this. Was Yeshua's new weapon. I don’t contemplate, I meditate, then off your fucking head. This that put-the-kids-to-bed. This that I got, I got, I got, I got. Realness, I just kill shit 'cause it's in my DNA. I got millions, I got riches buildin’ in my DNA. I got dark, I got evil, that rot inside my DNA. I got off, I got troublesome, heart inside my DNA. I just win again, then win again like Wimbledon, I serve. Yeah that's him again, the sound that engine in is like a bird. You see fireworks and Corvette tire skrrt the boulevard. I know how you work, I know just who you are. See you's a, you's a, you's a—. Bitch, your hormones prolly switch inside your DNA. Problem is, all that sucker shit inside your DNA. Daddy prolly snitched, heritage inside your DNA. Backbone don't exist, born outside a jellyfish, I gauge. See my pedigree most definitely don't tolerate the front. Shit I've been through prolly offend you. This is Paula’s oldest son. I know murder, conviction, burners. Boosters, burglars, ballers, dead, redemption. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 133421561, "title": "Plain Jane", "artist": "A$AP Ferg", "lyrics": "Alhamdulillah. Check in with me and do your job. Ferg is the name. Ben Baller did the chain. Tourneau for the watch. Presi Plain Jane. . Yamborghini chain, rest in peace to my superior. Hermès link could feed a village in Liberia. TMZ taking pictures, causin' mad hysteria. Momma see me on BET and started tearin' up. I'mma start killin' niggas. How you get that tribe?. I attended Harlem picnics where you risked your life. Uncle used to skim work, sellin' nicks at night. I was only 8 years old, watching Nick at Nite. Uncle Psycho was in that bathroom buggin'!. Knife to his guts, hope Daddy don't cut him. Suicidal doors brought to me with no advisory. He was pitchin' dummy, sellin' fiends mad ivory. Grandma had the arthritis in her hands, bad!. She was poppin' pills like rappers in society. I fuck yo bitch for the irony. I'll send Meechy at yo hoe if yo bitch keep eyein' me. . Ride with the mob. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 116423542, "title": "Redbone", "artist": "Childish Gambino", "lyrics": "Daylight. I wake up feeling like you won't play right. I used to know, but now that shit don't feel right. It made me put away my pride. So long. You made a nigga wait for some, so long. You make it hard for a boy like that to go wrong. I'm wishing I could make this mine, oh. . If you want it, yeah. You can have it, oh, oh, oh. If you need it, oooh. We can make it, oh. If you want it. You can have it. . But stay woke. Niggas creepin'. They gon' find you. Gon' catch you sleepin' (Oooh). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 115330100, "title": "She's with Me", "artist": "High Valley", "lyrics": "When the devil's knocking at my door. When I'm broken and I'm battle worn. Down in the valley, on my knees. Yea she's, yea she's with me. . Ain't she amazing, amazing, out of my league?. And ain't it crazy, crazy, she happened to me?. She calls me baby, baby, hard to believe. That she's, yea she's with me. . When my dreams are running out of road. And the world around me's turning cold. Anyone else would up and leave. But she's, yea she's with me. . Ain't she amazing, amazing, out of my league?. And ain't it crazy, crazy, she happened to me?. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 137587112, "title": "Mi Gente", "artist": "J Balvin feat. Willy William & Beyoncé", "lyrics": "Si el ritmo te lleva a mover la cabeza ya empezamos cómo es. Mi música no discrimina a nadie así que vamos a romper. . Con lo mío todos se mueven. La fiesta la llevo en mis genes. Yo soy la reina de los nenes. Mi gente no se detiene, aquí nadie se quiere ir. . Si el ritmo está en tu cabeza. Ahora suéltate y mueve los pies. Me encanta cuando el bajo suena. Empezamos a subir de. . (Nivel)Toda mi gente se mueve. La fiesta la llevo en mis genes. Yo soy la reina de los nenes. Mi musica los tiene fuerte bailando y se baila así.... . Tamo' rompiendo la discoteca. La fiesta no para, apenas comienza. C'est comme-ci, c'est comme-ça. Ma chèrie, la la la la la. . Francia... Colombia... Houston (freeze). J Balvin... Willy William... Beyoncé (freeze). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 138641653, "title": "Millionaire", "artist": "Chris Stapleton", "lyrics": "They say love is more precious than gold,. It can't be bought and it can't be sold. . I got love, enough to spare,. That makes me a millionaire.. . I got a woman with eyes that shine,. Down deep as a diamond mine,. She is my treasure so very rare,. She made me a millionaire,. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 145210156, "title": "Savior", "artist": "Iggy Azalea feat. Quavo", "lyrics": "Been around the world and I, I, I, I can't find my baby. Things gettin' crazy, losin' my patience. Why you keep me waitin'? Goin' through the phases. Got me walkin' out the house all done up. Just in case I see your face and you decide to run up. Yeah, I'm in a different place, I need someone to hold on to. I been sendin' up a prayer hope the call gets through. . 'Cause my heart beats for you only. I wonder if you even know me. Countin' down every moment. That I wait for ya, I wait for ya. I wonder if you even notice. Lately, I've been feelin' hopeless. Easy to lose focus, but I'll wait for ya. . I've been looking for a savior (hey). I've been looking for a savior (hey). I've been looking for a real one to hold on to (hey). I've been looking for a savior, savior, yeah, to save me. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 114588658, "title": "Say You Won't Let Go", "artist": "James Arthur", "lyrics": "I met you in the dark. You lit me up. You made me feel as though. I was enough. We danced the night away. We drank too much. I held your hair back when. You were throwing up. . Then you smiled over your shoulder. For a minute, I was stone cold sober. I pulled you closer to my chest. And you asked me to stay over. I said, I already told ya. I think that you should get some rest. . I knew I loved you then. But you'd never know. Cause I played it cool. When I was scared of letting go. I know I needed you. But I never showed. But I wanna stay with you. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 129347748, "title": "Slow Hands", "artist": "Niall Horan", "lyrics": "We should take this back to my place. That's what she said right to my face. 'Cause I want you bad, yeah I want you baby. I've been thinking about it all day. And I hope you feel the same way, yeah. 'Cause I want you bad, yeah, I want you, baby. . Slow, slow hands. Back sweat dripping down the dirty laundry. No, no chance. That I'm leaving here without you on me. I, I know, yeah, I already know that there ain't no stopping. Your plans and those slow hands. Slow hands. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 139200976, "title": "The Other Side", "artist": "Hugh Jackman feat. Zac Efron", "lyrics": "Right here, right now. I put the offer out. I don't want to chase you down. I know you see it. You run, with me. And I can cut you free. Out of the durdgery and walls you keep in. So trade that typical for something colorful. And if it's crazy, live a little crazy. You can play it sensible, a king of conventional. Or you can risk it all and see. Don't you wanna get away from the same old part you gotta play. 'Cause I got what you need. So come with me and take the ride. It'll take you to the other side. 'Cause you can do like you do. Or you can do like me. Stay in the cage, or you'll finally take the key. Oh, damn, suddenly you're free to fly. It'll take you to the other side. Okay, my friend, you want to cut me in. Well I hate to tell you, but it just won't happen. So thanks, but no. I think I'm good to go. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 145226313, "title": "Azukita", "artist": "Steve Aoki feat. Daddy Yankee, Play-N-Skillz & Elvis Crespo", "lyrics": "Hueh, hueh, hueh, hueh, hueh, hueh. ¡Masivo!. D-D-D-D-DY. Elvis Crespo (play, skills). Su-su-su-sube, Aoki. ¡Multitude'!. . La morena tiene algo. Que me llena de sabor. Y esa blanquita tiene algo. Que me arranca el descontrol (¡rrra!). . Dame una de azúcar. Dame dos de azúcar. Dame tres de azúcar. Blanca y morena, blanca y morena (¡plo-plo!). Dame una de azúcar. Dame dos de azúcar. Dame tres de azúcar. Blanca y morena, blanca y morena (¡plo!). Dame una de azúcar. Dame dos de azúcar. Dame tres de azúcar. Blanca y morena, blanca y morena (¡plo!). Dame una de azúcar (¡masivo!). Dame dos de azúcar. Dame tres de azúcar (¡Aoki!). Blanca y morena, blanca y morena (¡plo!). . ¡Multitudes!. ¡Masivo!. . Azukita (¡azúcar!). Azukita (¡azúcar!). Azukita pa' la niña bonita. Azukita (¡azúcar!). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 84252087, "title": "Make It Rain", "artist": "Ed Sheeran", "lyrics": "When the sins of my father. Weigh down in my soul. And the pain of my mother. Will not let me go. . Well I know there can come fire from the sky. To refine the purest of kings. And even though. I know this fire brings me pain. Even so. And just the same. . Make it rain. Make it rain down, Lord. Make it rain. Oh, make it rain. Make it rain. Make it rain down, Lord. Make it rain. Make it rain. . Oh, the seed needs the water. Before it grows out of the ground. But it just keeps on getting hotter. And the hunger more profound. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 144806330, "title": "Wait", "artist": "Maroon 5 feat. A Boogie Wit da Hoodie", "lyrics": "Dirty looks from your mother. Never seen you in a dress that color, no. It's a special occasion. Not invited, but I'm glad I made it, oh. . Let me apologize. I'll make up, make up, make up, make up for all those times. Your love, I don't wanna lose. I'm beggin', beggin', beggin', beggin', I'm beggin' you. . Wait, can you turn around, can you turn around?. Just wait, can we work this out, can we work this out?. Just wait, can you come here please?. 'Cause I wanna be with you. . Wait, can you turn around, can you turn around?. Just wait, can we work this out, can we work this out?. Just wait, could you come here please?. 'Cause I wanna be with you. . Can we talk for a moment?. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 108068259, "title": "Blue Ain't Your Color", "artist": "Keith Urban", "lyrics": "I can see you over there. Starring at your drink. Watchin' that ice sink. All alone tonight. . And chances are. You're sittin' here in this bar. ‘Cause he ain't gonna treat you right. Well, it's probably not my place. But I'm gonna say it anyway. ‘Cause you look like. You haven't felt the fire. Had a little fun. Hadn't had a smile in a little while. Baby. . Blue looks good on the sky. Looks good on that neon buzzin' on the wall. But darling, it don't match your eyes. I'm tellin' you. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 139200982, "title": "From Now On", "artist": "Hugh Jackman feat. The Greatest Showman Ensemble", "lyrics": "I saw the sun begin to dim. And felt that winter wind. Blow cold. A man learns who is there for him. When the glitter fades and the walls won't hold. Cause from then, rubble. What remains. Can only be what's true. If all was lost. Is more I gain. Cause it led me back. To you. . From now on. These eyes will not be blinded by the light. From now on. What's waited till tomorrow starts tonight. Tonight. Let this promise in me start. Like an anthem in my heart. From now on. From now on. . I drank champagne with kings and queens. The politicians praised my name. But those are someone else's dreams. The pitfalls of the man I became. For years and years. I chased their cheers. The crazies be always needed more. But when I stop. And see you here. I remember who all this was for. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 129998740, "title": "Strip That Down", "artist": "Liam Payne feat. Quavo", "lyrics": "Huncho. Quavo. Yo yo. . You know, I've been taking some time. And I've been keeping to myself (self). I had my eyes up on the prize. Ain't watching anybody else. But your love, it hit me hard, girl. Yeah, you're bad for my health. I love the cards, that I've been dealt. . Do you feel the same as well?. . You know, I used to be in 1D (now I'm out, free). People want me for one thing (that's not me). . I'm not changing, the way, that I (used to be). I just wanna have fun (and get rowdy). One Coke and Bacardi (sippin' lightly). When I walk inside the party (girls on me). F1 type Ferrari (6 gear speed). Girl, I love it when your body (grinds on me). Oh yeah. . You know, I love it, when the music's loud. But c'mon, strip that down for me, baby. Now there's a lot of people in the crowd. But only you can dance with me. . So put your hands on my body. And swing that round for me, baby (swing). You know, I love it when the music's loud. But c'mon, strip that down for me (yeah, yeah, yeah, yeah). .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 128564618, "title": "Broken", "artist": "lovelytheband", "lyrics": "I like that you're broken. broken like me. Maybe that makes me a fool. . I like that you're lonely. lonely like me. I could be lonely with you. . I met you late night, at a party. Some trust fund baby's Brooklyn loft. By the bathroom, you said let's talk,. But my confidence is wearing off. . These aren't my people. These aren't my friends. She grabbed my face and that's when she said. . I like that you're broken. broken like me. Maybe that makes me a fool. . .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 84232666, "title": "Round Here Buzz", "artist": "Eric Church", "lyrics": "Another Friday night. There's a line of cars leaving. Home team's got an out-of-towner. Me, I'm sitting on the hood of mine drinking. I'm just a parking lot down-and-outer. . Under that high school bleacher. I drove that preacher's daughter crazy. Her mama was my homeroom teacher. And her dad was hell bent on saving me. . Yeah, I'm sure there's higher highs. Where the high risers rise. But me, I'm gonna sit right here tonight, and. . Catch me a 'round here buzz. Cause you ain't 'round here none. Keep putting 'em down here, 'nother round here. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 109591892, "title": "No Hard Feelings", "artist": "The Avett Brothers", "lyrics": "When my body won't hold me anymore. And it finally lets me free. Will I be ready?. When my feet won't walk another mile?. And my lips give their last kiss goodbye?. Will my hands be steady when I lay down my fears, my hopes, and my doubts?. The rings on my fingers, and the keys to my house. With no hard feelings?. . When the sun hangs low in the west. And the line in my chest won't be kept held at bay any longer. When the jealousy fades away. And it's ash and dust for casual lust. And it's just hallelujah. And love in thoughts and love in the words. Love in the songs they sing in the church. And no hard feelings. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 132633875, "title": "Unforgettable", "artist": "Thomas Rhett", "lyrics": "It was the 14th of October. Had that t-shirt off your shoulder. I was drunk, said I was sober. And you said yeah right. We were talkin' for a minute. Then some guy tried to cut in. You took my hand and we pretended. Like I was your guy. . Oh, then I tried to guess your middle name. For 30 minutes bet we played that game. . That mango-rita you were drinkin'. And that Coldplay song that you were singin'. And I bet right now you're probably thinkin'. That it's crazy I remember every detail, but I do. From your blue jeans to your shoes. Girl, that night was just like you. Unforgettable. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 112569270, "title": "She Ain't in It", "artist": "Jon Pardi", "lyrics": "Appreciate the call. Means a lot and all. Yeah, I've got a minute. You and me can talk about anything you want. A long as she ain't in it. Say, it's been at least a month. Since I've had any fun, buddy, I'll admit it. Yeah, but I remember going out. Think I'm ready for a crowd. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 142504986, "title": "Never Be the Same (Radio Edit)", "artist": "Camila Cabello", "lyrics": "Something must've gone wrong in my brain. Got your chemicals all in my veins. Feeling all the highs, feel all the pain. Let go of the wheel, it's the borderline. Now I'm seeing red, not thinking straight. Blurring all the lines, you intoxicate me. . Just like nicotine, rushin' me, touching me. Suddenly, I'm a fiend and you're all I need. All I need, yeah, you're all I need. . It's you, babe. And I'm a sucker for the way that you move, babe. And I could try to run, but it would be useless. You're to blame. Just one hit of you, I knew I'll never be the same. It's you, babe. And I'm a sucker for the way that you move, babe. And I could try to run, but it would be useless. You're to blame. Just one hit of you, I knew I'll never ever, ever be the same. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 132622992, "title": "HandClap", "artist": "Fitz & The Tantrums", "lyrics": "Turn it up. . Somebody save your soul cause you've been sinning in this city I know. Too many troubles, all these lovers got you losing control. You're like a drug to me, a luxury, my sugar and gold. I want the good life. Every good night you're a hard one to hold. . Cause you don't even know. I can make your hands clap. Said I can make your hands clap. . Somebody save your soul cause you've been sinning in this city I know. Too many troubles, all these lovers got you losing control. You're like a drug to me, a luxury, my sugar and gold. I want your sex and your affection when they're holding you close. . Cause you don't even know. I can make your hands clap. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}, {"track_id": 141586326, "title": "Roll In Peace", "artist": "Kodak Black feat. XXXTENTACION", "lyrics": "Aye, everything be like, off the top these days like. (We got London on the track!). These days, I don't even know what a pad is these days. Fuck that hoe 'cause she a nat nat. . You ain't the one for me, baby. You ain't got shit I need, bitch. You want me to take my time with you. Well maybe I'm not your speed bitch. Maybe I'm out your league, bitch. You ain't even got no cheese, bitch. Maybe I'm just too G for you. Or maybe I'm just too street, bitch. . I can't even roll in peace (why). Everybody notice me (yeah). I can't even go to sleep (why). I'm rolling on a bean (yeah). They tried to give me eight. Got on my knees like \"Jesus please\". He don't even believe in Jesus. Why you got a Jesus piece. If you wanna leave just leave, but you ain't gotta lie to me. Even the blind can see. That you ain't gon ride for me. You ain't even showing me the love you say you got me for me. There ain't no loyalty, you lied to me. You said that you gon' ride for me. . Baby that's blasphemy, yeah. Baby you're bad for me, yeah. Say you gon' clap for me, yeah. Say you gon' blast for me, yeah. Why you ain't show me none of the love you say you have for me, yeah. I was goin' through tragedy. Bitch, I needed you drastically, yeah. .... . ******* This Lyrics is NOT for Commercial use *******. (1409617541353)"}]